[
  {
    "source_url": "https://www.musictheory.net/lessons",
    "title": "musictheory.net - Lessons",
    "section_heading": null,
    "content": "Our lessons are provided online for free. If they help you, please purchase our apps to support the site.\nFAQ Legal Privacy",
    "chunk_index": 0
  },
  {
    "source_url": "https://viva.pressbooks.pub/openmusictheory/",
    "title": "ERROR: The request could not be satisfied",
    "section_heading": "The request could not be satisfied.",
    "content": "Generated by cloudfront (CloudFront) Request ID: f367650M4Vi2fyI4SCZJg_vNZlNkzCJP6IgApFVHNPrwG0UpzXopkw==",
    "chunk_index": 0
  },
  {
    "source_url": "https://www.jazzadvice.com/",
    "title": "The Real Jazzadvice  Jazz Improvisation, Tips & Techniques",
    "section_heading": null,
    "content": "Inspiration for improvisers\nLog In Log In Here Get Premium See Our Courses\nLog In Here\nGet Premium\nSee Our Courses\nLessons Start Here Browse Lessons Premium Lessons\nStart Here\nBrowse Lessons\nPremium Lessons\nConnect Join Newsletter Facebook Twitter Donate Submit a Review Contact Us About Us\nJoin Newsletter\nFacebook\nTwitter\nDonate\nSubmit a Review\nContact Us\nAbout Us\nCourses All Courses Jazz Theory Unlocked The Ear Training Method Melodic Power Visualization Course Reprogramming Course Tools For Musicians\nAll Courses\nJazz Theory Unlocked\nThe Ear Training Method\nMelodic Power\nVisualization Course\nReprogramming Course\nTools For Musicians\nJoin Premium\nLog In Here\nGet Premium\nSee Our Courses\nStart Here\nBrowse Lessons\nPremium Lessons\nJoin Newsletter\nFacebook\nTwitter\nDonate\nSubmit a Review\nContact Us\nAbout Us\nAll Courses\nJazz Theory Unlocked\nThe Ear Training Method\nMelodic Power\nVisualization Course\nReprogramming Course\nTools For Musicians\nLog In Log In Here Get Premium See Our Courses\nLog In Here\nGet Premium\nSee Our Courses\nLessons Start Here Browse Lessons Premium Lessons\nStart Here\nBrowse Lessons\nPremium Lessons\nConnect Join Newsletter Facebook Twitter Donate Submit a Review Contact Us About Us\nJoin Newsletter\nFacebook\nTwitter\nDonate\nSubmit a Review\nContact Us\nAbout Us\nCourses All Courses Jazz Theory Unlocked The Ear Training Method Melodic Power Visualization Course Reprogramming Course Tools For Musicians\nAll Courses\nJazz Theory Unlocked\nThe Ear Training Method\nMelodic Power\nVisualization Course\nReprogramming Course\nTools For Musicians\nJoin Premium\nLog In Here\nGet Premium\nSee Our Courses\nStart Here\nBrowse Lessons\nPremium Lessons\nJoin Newsletter\nFacebook\nTwitter\nDonate\nSubmit a Review\nContact Us\nAbout Us",
    "chunk_index": 0
  },
  {
    "source_url": "https://www.jazzadvice.com/",
    "title": "The Real Jazzadvice  Jazz Improvisation, Tips & Techniques",
    "section_heading": null,
    "content": "All Courses\nJazz Theory Unlocked\nThe Ear Training Method\nMelodic Power\nVisualization Course\nReprogramming Course\nTools For Musicians\nThe #1 site for handcrafted Jazz Lessons & Courses that will inspire you to reach your musical goals. Join over 100K Subscribers by signing up to our FREE newsletter and start improving today!\nWhen you first start learning to improvise, the focus is often on which notes work over a chordwhich scale to play, finding the key, or memorizing chord symbols. But over ...\nWhen it comes to the blues, few voices sing as clearly, or as creatively, as Charlie Parkers. While Bird is often celebrated for his iconic solos and well-known standards, theres ...\nFor any improviser learning jazz standards, one of the greatest challenges isnt just learning the chords to a tune  its making music with them when you take a solo. ...\nThe piano is a cornerstone of this music, lending some of the finest composers, soloists, and forward thinking improvisers throughout history. And as a serious musician, you should be studying ...\nCharlie Parkers iconic take on the Blues form, commonly referred to as the Bird Blues, is a staple of the modern jazz repertoire and a rite of passage for every ...\nAs players today, we have a ton of resources to draw from in the practice room. But when it comes to the more musical areas of improvisation, something is missing. ...\nHow Tunes Really Work\nOur latest offering is a video lecture series that will give you a strong understanding of harmony and teach you the WHY behind everything in jazz. If you want to make sense of music theory on a deep level, this course is for you.\nhear like a pro",
    "chunk_index": 1
  },
  {
    "source_url": "https://www.jazzadvice.com/",
    "title": "The Real Jazzadvice  Jazz Improvisation, Tips & Techniques",
    "section_heading": "The Ear Training Method",
    "content": "This audio course is an in-depth ear training program designed to quickly improve your ear. Inside you'll learn to break free from the written page and play the music you hear. In the process you'll master the sounds of intervals, chords, voicings, chord-tones, progressions and more!\nJazz Language Secrets\nThis is a powerful Video & eBook course for all levels, that will guide you through the nuts-and-bolts of how to improvise strong melodies on the most common chords. You'll learn dozens of powerful melodic techniques on all the primary chords types.\nTrain Your Brain\nIn this course, you'll discover techniques to mentally master chord symbols, chord tones and common progressions on a deeper level than ever before. Learning to visualize is a crucial step for every jazz improviser, helping them to memorize tunes more easily and think more clearly about chords and progressions.\nMaster Your Mind\nThis 30 day audio course for every musician will reprogram your mind to reach your optimal creative state as a musician. If you've ever battled with stage fright, self worth, motivation, or just want to feel inspired about playing again, this course will get you there.\nWere Forrest & Eric. Weve learned from a ton of great players like Mulgrew Miller, Rich Perry, and Harold Mabern, and now its our mission to teach you.\nFrom the Bay Area, he's lived in California, Colorado, and New York, learning and playing music. He's studied extensively with Rich Perry, Mulgrew Miller, and a lot of other amazing musicians. When he's not playing saxophone, you can find him traveling, boxing, and training in Muay Thai.\nMore about Forrest",
    "chunk_index": 2
  },
  {
    "source_url": "https://www.jazzadvice.com/",
    "title": "The Real Jazzadvice  Jazz Improvisation, Tips & Techniques",
    "section_heading": "Eric O'Donnell",
    "content": "Originally from Northeast Ohio, he moved to New York/New Jersey to go to graduate school. He's studied with greats such as Bill Mobley, Mulgrew Miller, Ingrid Jensen, and many more. In his free time he's usually working out, reading, or training for a marathon.\nMore about Eric\nPremium Members get access to special lessons and help keep Jazzdavice alive\nWhen you first start learning to improvise, the focus is often on which notes work over a chordwhich scale to play, finding the key, or memorizing chord symbols. But over ...\nFor any improviser learning jazz standards, one of the greatest challenges isnt just learning the chords to a tune  its making music with them when you take a solo. ...\nCharlie Parkers iconic take on the Blues form, commonly referred to as the Bird Blues, is a staple of the modern jazz repertoire and a rite of passage for every ...\nDeveloping your ear leads to improvisational freedom\nLearning from the masters is the key to learning jazz quickly\nStudying the classic jazz repertoire is essential for everyone\nDeveloping good practice habits leads to great results\nAcquiring jazz language is fundamental to improvising\nUnderstanding harmony on a deep level is crucial\nIf your goal as a jazz musician is to get better fast and have fun doing it, then make sure to join over 100K Jazzadvice subscribers by signing up to our FREE newsletter. Each week, we'll send you powerful resources to keep you moving forward in your jazz journey.\nClick the lovely button below to get started\nBrowse Lessons\nPremium Lessons\nGet Premium\nTools for Musicians\nJazz Theory\nMelodic Power\nEar Training Method\nVisualization\nReprogramming\nTranscribing\nJazz Language\nMusic Theory\nJazz Standards\nEar training\nJoin Newsletter\n2025 Jazzadvice. All rights reserved\nPrivacy Policy | Terms of Use",
    "chunk_index": 3
  },
  {
    "source_url": "https://www.jazzadvice.com/",
    "title": "The Real Jazzadvice  Jazz Improvisation, Tips & Techniques",
    "section_heading": "Connect",
    "content": "Home\nLessons\nStart Here\nBrowse Lessons\nPremium Lessons\nJazz Courses\nJoin Premium\nConnect\nNewsletter\nContact Us\nAbout Us\nLog in",
    "chunk_index": 4
  },
  {
    "source_url": "https://tonesavvy.com/",
    "title": "ToneSavvy | Music Theory & Ear Training",
    "section_heading": null,
    "content": "Exercises\nMusic Theory Note Names Interval Identification Interval Building Chord Identification Chord Building Chord Functions Paced Note Names Rhythm Dictation Rhythm Performance Key Signatures Scale Building Piano Keys Guitar Frets Violin Fingerboard Viola Fingerboard Cello Fingerboard Double Bass Fingerboard First Species Counterpoint\nNote Names\nInterval Identification\nInterval Building\nChord Identification\nChord Building\nChord Functions\nPaced Note Names\nRhythm Dictation\nRhythm Performance\nKey Signatures\nScale Building\nPiano Keys\nGuitar Frets\nViolin Fingerboard\nViola Fingerboard\nCello Fingerboard\nDouble Bass Fingerboard\nFirst Species Counterpoint\nEar Training Intervals Chords Scales Chord Progressions Perfect Pitch Scale Degrees Intervals in Context Melodic Dictation\nIntervals\nChords\nScales\nChord Progressions\nPerfect Pitch\nScale Degrees\nIntervals in Context\nMelodic Dictation\nNote Names\nInterval Identification\nInterval Building\nChord Identification\nChord Building\nChord Functions\nPaced Note Names\nRhythm Dictation\nRhythm Performance\nKey Signatures\nScale Building\nPiano Keys\nGuitar Frets\nViolin Fingerboard\nViola Fingerboard\nCello Fingerboard\nDouble Bass Fingerboard\nFirst Species Counterpoint\nIntervals\nChords\nScales\nChord Progressions\nPerfect Pitch\nScale Degrees\nIntervals in Context\nMelodic Dictation\nUse in your classroom\nLog In\nUse the exercises in your class\nAs a subscriber to ToneSavvy.com you can manage your student list, give out carefully tailored assignments, and check your students' scores, all online.\nYour students can complete their assignments from any computer or mobile device through the web.\nSubscribe now!\nIf your teacher gave you a username and teacher code to use here, sign in for your assignments.",
    "chunk_index": 0
  },
  {
    "source_url": "https://tonesavvy.com/",
    "title": "ToneSavvy | Music Theory & Ear Training",
    "section_heading": "Studying Music?",
    "content": "If not, you can still use the free exercises to practice your skills. For best results, practice a little bit every day.\nChoose from a broad range of exercises to focus on specific skills. Here are some of our most popular exercises:\nNote names (sight reading): Practice sight reading by identifying the names of notes displayed on the staff.\nInterval Building: Practice building intervals by placing notes on the staff.\nChord Identification: Practice identifying chords displayed on the staff.\nPractice all of the exercises for free here.\nThese exercises will improve your musical ability by developing a more intuitive understanding of what you hear.",
    "chunk_index": 1
  },
  {
    "source_url": "https://tonesavvy.com/",
    "title": "ToneSavvy | Music Theory & Ear Training",
    "section_heading": "Ear Training Practice",
    "content": "Intervals: In this exercise, you will hear two notes in sequence. Your goal is to identify the interval between the two notes.\nChords: In this exercise, you will hear a chord. Your goal is to identify the type of chord that you heard.\nScales: In this exercise, you will hear a scale. Your goal is to identify the name of the scale that you heard.\nChord Progressions: In this exercise, you will hear a chord progression. Your goal is to identify each chord that you heard.\nPerfect Pitch: In this exercise, you will hear a single note. Your goal is to identify the name of the note.\nScale Degrees (functional): In this exercise, you will hear a short chord progression followed by a single note. You must identify the scale degree of that note relative to the key established by the chord progression. This is also known as \"functional ear training\".\nIntervals in Context (functional): This exercise combines the \"Intervals\" and \"Scale Degrees\" exercises. In this exercise, you will hear a short chord progression followed by two notes. You must identify the major scale degrees of the two notes relative to the key established by the chord progression as well as the interval between the two notes.\nMelodic Dictation: In this exercise, you will hear a short chord progression followed by a short melody. You must identify the major scale degree of each note in the melody.\nThese exercises will improve your understanding of music concepts and your speed at interpreting from the staff.",
    "chunk_index": 2
  },
  {
    "source_url": "https://tonesavvy.com/",
    "title": "ToneSavvy | Music Theory & Ear Training",
    "section_heading": "Music Theory Practice",
    "content": "Note Names: Identify the names of notes that appear on the staff.\nInterval Building: Build intervals on the staff. Given a starting note and the name of an interval, can you place the second note?\nInterval Identification: Identify intervals on the staff.\nChord Building: Build triads and 7th chords on the staff. Challenge yourself with different inversions!\nChord Identification: Identify triads and 7th chords on the staff. This game helps you identify 3- and 4-note chords and their inversions quickly on sight.\nChord Functions: Build chords based on a key and chord function.\nPaced Note Names: Identify the notes sliding across the staff before they disappear into oblivion!\nRhythm Dictation: Notate rhythmic patterns based on what you hear using whole notes, half notes, quarter notes, and eighth notes, depending on difficulty level.\nRhythm Performance: Tap out the rhythm displayed on the staff.\nKey Signature Identification: Identify the key signature that appears on the staff.\nScale Building: Build scales on the staff. Includes modes (Ionian, Dorian, Phrygian...) as well as other scales.\nPiano Keys: Identify the notes on the staff by clicking the proper key on an on-screen piano keyboard.\nTry the exercises\nUse the exercises in your class\nHome\nContact\nAbout\nPrivacy Policy\nTerms of Service",
    "chunk_index": 3
  },
  {
    "source_url": "https://tonedear.com/",
    "title": "Ear Training",
    "section_heading": null,
    "content": "Home\nExercises Intervals Chords Scales Chord Progressions Perfect Pitch Scale Degrees Intervals in Context Melodic Dictation\nIntervals\nChords\nScales\nChord Progressions\nPerfect Pitch\nScale Degrees\nIntervals in Context\nMelodic Dictation\nHow to practice\nFor teachers\nIntervals\nChords\nScales\nChord Progressions\nPerfect Pitch\nScale Degrees\nIntervals in Context\nMelodic Dictation\nAndroid & iOS App\nContact Me\nThese exercises will improve your musical ability by developing a more intuitive understanding of what you hear. For best results, practice a little bit every day:",
    "chunk_index": 0
  },
  {
    "source_url": "https://tonedear.com/",
    "title": "Ear Training",
    "section_heading": "Ear Training Practice",
    "content": "Intervals: In this exercise, you will hear two notes in sequence. Your goal is to identify the interval between the two notes.\nChords: In this exercise, you will hear a chord. Your goal is to identify the type of chord that you heard.\nScales: In this exercise, you will hear a scale. Your goal is to identify the name of the scale that you heard.\nChord Progressions: In this exercise, you will hear a chord progression. Your goal is to identify each chord that you heard.\nPerfect Pitch: In this exercise, you will hear a single note. Your goal is to identify the name of the note.\nScale Degrees (functional): In this exercise, you will hear a short chord progression followed by a single note. You must identify the scale degree of that note relative to the key established by the chord progression. This is also known as \"functional ear training\".\nIntervals in Context (functional): This exercise combines the \"Intervals\" and \"Scale Degrees\" exercises. In this exercise, you will hear a short chord progression followed by two notes. You must identify the major scale degrees of the two notes relative to the key established by the chord progression as well as the interval between the two notes.\nMelodic Dictation: In this exercise, you will hear a short chord progression followed by a short melody. You must identify the major scale degree of each note in the melody.\nIf you are a teacher who would like to use these exercises in the classroom, check out the teacher version of the site:\nGive assignments online with specific exercise settings\nView student scores\nMore exercises -- music theory exercises like chord building and key signature identification\nClick here to use the teacher site.",
    "chunk_index": 1
  },
  {
    "source_url": "https://www.earmaster.com/",
    "title": "The #1 App for Ear Training, Sight-Singing, and Rhythm - EarMaster",
    "section_heading": null,
    "content": "Products Ear Training, Sight-Singing, Rhythm, and Music Theory EarMaster for All Musicians EarMaster Cloud for Education License Comparison Free Tools Interval Song Chart Tool Music Theory Online Course\nEar Training, Sight-Singing, Rhythm, and Music Theory EarMaster for All Musicians EarMaster Cloud for Education License Comparison\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nFree Tools Interval Song Chart Tool Music Theory Online Course\nInterval Song Chart Tool\nMusic Theory Online Course\nBuy Now\nDownload\nSupport Knowledge Base Frequently Asked Questions Support Forum Tutorials Support Toolbox Serial Number Recovery Register Your License EarMaster Cloud Login Recovery EarMaster Cloud Guides for Students Guides for Teachers Guides for Administrators\nKnowledge Base Frequently Asked Questions Support Forum Tutorials\nFrequently Asked Questions\nSupport Forum\nTutorials\nSupport Toolbox Serial Number Recovery Register Your License EarMaster Cloud Login Recovery\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nEarMaster Cloud Guides for Students Guides for Teachers Guides for Administrators\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nCommunity Forum Become an Affiliate Newsletter Signup\nForum\nBecome an Affiliate\nNewsletter Signup\nBlog\nCompany Contact About EarMaster Work at EarMaster Press Material Become a Reseller\nContact\nAbout EarMaster\nWork at EarMaster\nPress Material\nBecome a Reseller\nCloud Login\nEar Training, Sight-Singing, Rhythm, and Music Theory EarMaster for All Musicians EarMaster Cloud for Education License Comparison\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nFree Tools Interval Song Chart Tool Music Theory Online Course\nInterval Song Chart Tool\nMusic Theory Online Course\nInterval Song Chart Tool\nMusic Theory Online Course\nKnowledge Base Frequently Asked Questions Support Forum Tutorials\nFrequently Asked Questions\nSupport Forum\nTutorials",
    "chunk_index": 0
  },
  {
    "source_url": "https://www.earmaster.com/",
    "title": "The #1 App for Ear Training, Sight-Singing, and Rhythm - EarMaster",
    "section_heading": null,
    "content": "Frequently Asked Questions\nSupport Forum\nTutorials\nSupport Toolbox Serial Number Recovery Register Your License EarMaster Cloud Login Recovery\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nEarMaster Cloud Guides for Students Guides for Teachers Guides for Administrators\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nForum\nBecome an Affiliate\nNewsletter Signup\nContact\nAbout EarMaster\nWork at EarMaster\nPress Material\nBecome a Reseller",
    "chunk_index": 1
  },
  {
    "source_url": "https://www.earmaster.com/",
    "title": "The #1 App for Ear Training, Sight-Singing, and Rhythm - EarMaster",
    "section_heading": null,
    "content": "Products Ear Training, Sight-Singing, Rhythm, and Music Theory EarMaster for All Musicians EarMaster Cloud for Education License Comparison Free Tools Interval Song Chart Tool Music Theory Online Course\nEar Training, Sight-Singing, Rhythm, and Music Theory EarMaster for All Musicians EarMaster Cloud for Education License Comparison\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nFree Tools Interval Song Chart Tool Music Theory Online Course\nInterval Song Chart Tool\nMusic Theory Online Course\nBuy Now\nDownload\nSupport Knowledge Base Frequently Asked Questions Support Forum Tutorials Support Toolbox Serial Number Recovery Register Your License EarMaster Cloud Login Recovery EarMaster Cloud Guides for Students Guides for Teachers Guides for Administrators\nKnowledge Base Frequently Asked Questions Support Forum Tutorials\nFrequently Asked Questions\nSupport Forum\nTutorials\nSupport Toolbox Serial Number Recovery Register Your License EarMaster Cloud Login Recovery\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nEarMaster Cloud Guides for Students Guides for Teachers Guides for Administrators\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nCommunity Forum Become an Affiliate Newsletter Signup\nForum\nBecome an Affiliate\nNewsletter Signup\nBlog\nCompany Contact About EarMaster Work at EarMaster Press Material Become a Reseller\nContact\nAbout EarMaster\nWork at EarMaster\nPress Material\nBecome a Reseller\nCloud Login\nEar Training, Sight-Singing, Rhythm, and Music Theory EarMaster for All Musicians EarMaster Cloud for Education License Comparison\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nFree Tools Interval Song Chart Tool Music Theory Online Course\nInterval Song Chart Tool\nMusic Theory Online Course\nInterval Song Chart Tool\nMusic Theory Online Course\nKnowledge Base Frequently Asked Questions Support Forum Tutorials\nFrequently Asked Questions\nSupport Forum\nTutorials",
    "chunk_index": 2
  },
  {
    "source_url": "https://www.earmaster.com/",
    "title": "The #1 App for Ear Training, Sight-Singing, and Rhythm - EarMaster",
    "section_heading": null,
    "content": "Frequently Asked Questions\nSupport Forum\nTutorials\nSupport Toolbox Serial Number Recovery Register Your License EarMaster Cloud Login Recovery\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nEarMaster Cloud Guides for Students Guides for Teachers Guides for Administrators\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nForum\nBecome an Affiliate\nNewsletter Signup\nContact\nAbout EarMaster\nWork at EarMaster\nPress Material\nBecome a Reseller\n4000 exercises for all levels: intervals, scales, chords, cadences, melodies, rhythm, sight-singing - It's all there!\nThe perfect choice for music students, hobbyists and professionals who want to improve their musical skills.\nBuilt-in courses for ABRSM Aural, RCM Voice, Solfege, etc.\nEasy to use, motivating, and extremely efficient!\nReady to boost your musical skills? Let's go!\nDownload Buy now\nTeaching Music? Discover our all-in-one educational solution EarMaster Cloud\nWhen it comes to your musical skills, don't settle. EarMaster is the leading app for ear training, sight-singing practice and rhythm training, used by some of the best music schools, and developed in close partnership with recognized music teachers. It will help you reach your music goals with thousands of motivating and effective exercises for all skill levels.\nMore features Version for education Download\nFor musicians\nFor schools\nLicense Comparison\nInterval Song Chart Maker\nOnline Music Theory\nTutorials\nFAQ\nSerial Number Recovery\nCloud Login Recovery\nContact us\nForum\nBecome an Affiliate\nBecome an Early Adopter\nEarMaster 2025. All rights reserved\nSwitch language\nPrivacy Policy | Terms and Conditions",
    "chunk_index": 3
  },
  {
    "source_url": "https://www.earmaster.com/",
    "title": "The #1 App for Ear Training, Sight-Singing, and Rhythm - EarMaster",
    "section_heading": "Community",
    "content": "Products Products Ear Training, Sight-Singing, Rhythm, and Music Theory Ear Training, Sight-Singing, Rhythm, and Music Theory EarMaster for All Musicians EarMaster Cloud for Education License Comparison Free Tools Free Tools Interval Song Chart Tool Music Theory Online Course\nProducts\nEar Training, Sight-Singing, Rhythm, and Music Theory Ear Training, Sight-Singing, Rhythm, and Music Theory EarMaster for All Musicians EarMaster Cloud for Education License Comparison\nEar Training, Sight-Singing, Rhythm, and Music Theory\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nFree Tools Free Tools Interval Song Chart Tool Music Theory Online Course\nFree Tools\nInterval Song Chart Tool\nMusic Theory Online Course\nBuy Now\nDownload\nSupport Support Knowledge Base Knowledge Base Frequently Asked Questions Support Forum Tutorials EarMaster Cloud EarMaster Cloud Guides for Students Guides for Teachers Guides for Administrators Support Toolbox Support Toolbox Serial Number Recovery Register Your License EarMaster Cloud Login Recovery\nSupport\nKnowledge Base Knowledge Base Frequently Asked Questions Support Forum Tutorials\nKnowledge Base\nFrequently Asked Questions\nSupport Forum\nTutorials\nEarMaster Cloud EarMaster Cloud Guides for Students Guides for Teachers Guides for Administrators\nEarMaster Cloud\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nSupport Toolbox Support Toolbox Serial Number Recovery Register Your License EarMaster Cloud Login Recovery\nSupport Toolbox\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nCommunity Community Forum Become an Affiliate Newsletter Signup\nCommunity\nForum\nBecome an Affiliate\nNewsletter Signup\nBlog\nCompany Company Contact About EarMaster Work at EarMaster Press Material Become a Reseller\nCompany\nContact\nAbout EarMaster\nWork at EarMaster\nPress Material\nBecome a Reseller\nCloud Login",
    "chunk_index": 4
  },
  {
    "source_url": "https://www.earmaster.com/",
    "title": "The #1 App for Ear Training, Sight-Singing, and Rhythm - EarMaster",
    "section_heading": "Community",
    "content": "Products\nEar Training, Sight-Singing, Rhythm, and Music Theory Ear Training, Sight-Singing, Rhythm, and Music Theory EarMaster for All Musicians EarMaster Cloud for Education License Comparison\nEar Training, Sight-Singing, Rhythm, and Music Theory\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nFree Tools Free Tools Interval Song Chart Tool Music Theory Online Course\nFree Tools\nInterval Song Chart Tool\nMusic Theory Online Course\nEar Training, Sight-Singing, Rhythm, and Music Theory\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nFree Tools\nInterval Song Chart Tool\nMusic Theory Online Course\nSupport\nKnowledge Base Knowledge Base Frequently Asked Questions Support Forum Tutorials\nKnowledge Base\nFrequently Asked Questions\nSupport Forum\nTutorials\nEarMaster Cloud EarMaster Cloud Guides for Students Guides for Teachers Guides for Administrators\nEarMaster Cloud\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nSupport Toolbox Support Toolbox Serial Number Recovery Register Your License EarMaster Cloud Login Recovery\nSupport Toolbox\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nKnowledge Base\nFrequently Asked Questions\nSupport Forum\nTutorials\nEarMaster Cloud\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nSupport Toolbox\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nCommunity\nForum\nBecome an Affiliate\nNewsletter Signup\nCompany\nContact\nAbout EarMaster\nWork at EarMaster\nPress Material\nBecome a Reseller",
    "chunk_index": 5
  },
  {
    "source_url": "https://www.guitartricks.com/",
    "title": "Just a moment...",
    "section_heading": "www.guitartricks.com",
    "content": "Verifying you are human. This may take a few seconds.\n963cb6ba4b357103",
    "chunk_index": 0
  }
]