[
  {
    "source": "https://www.jazzadvice.com/",
    "content": "The Real Jazzadvice • Jazz Improvisation, Tips & Techniques\nSkip to content\nInspiration for improvisers\nMenu\nMenu\nLog In\nLog In Here\nGet Premium\nSee Our Courses\nLessons\nStart Here\nBrowse Lessons\nPremium Lessons\nConnect\nJoin Newsletter\nFacebook\nTwitter\nDonate\nSubmit a Review\nContact Us\nAbout Us\nCourses\nAll Courses\nJazz Theory Unlocked\nThe Ear Training Method\nMelodic Power\nVisualization Course\nReprogramming Course\nTools For Musicians\nJoin Premium\nMenu\nLog In\nLog In Here\nGet Premium\nSee Our Courses\nLessons\nStart Here\nBrowse Lessons\nPremium Lessons\nConnect\nJoin Newsletter\nFacebook\nTwitter\nDonate\nSubmit a Review\nContact Us\nAbout Us\nCourses\nAll Courses\nJazz Theory Unlocked\nThe Ear Training Method\nMelodic Power\nVisualization Course\nReprogramming Course\nTools For Musicians\nJoin Premium\nWelcome to Jazzadvice\nThe #1 site for handcrafted Jazz Lessons & Courses that will inspire you to reach your musical goals.\nJoin over 100K Subscribers\nby signing up to our\nFREE\nnewsletter and start improving today!\nSubscribe\nThe Latest Lessons\nMastering Forward Motion in Jazz Improvisation\nWhen you first start learning to improvise, the focus is often on which notes work over a chord…which scale to play, finding the key, or memorizing chord symbols. But over ...\nPlaying Techniques\nPremium\n10 Hidden Gems from Charlie Parker on the Blues\nWhen it comes to the blues, few voices sing as clearly, or as creatively, as Charlie Parker’s. While Bird is often celebrated for his iconic solos and well-known standards, there’s ...\nJazz Standards\nBlues\nCharlie Parker\nBill Evans: 4 Tools for Creating Harmonic Motion\nFor any improviser learning jazz standards, one of the greatest challenges isn’t just learning the chords to a tune – it’s making music with them when you take a solo. ...\nChords\nJazz Musicians\nJazz Standards\nPremium\nBill Evans\n9 Incredible Jazz Piano Solos You Should Know\nThe piano is a cornerstone of this music, lending some of the finest composers, soloists, and forward thinking improvisers throughout history. And as a serious musician, you should be studying ...\nJazz Musicians\nBrad Mehldau\nBud Powell\nChick Corea\nHerbie Hancock\nMcCoy Tyner\nMulgrew Miller\nBird Blues: A Player’s Guide\nCharlie Parker’s iconic take on the Blues form, commonly referred to as the “Bird Blues,” is a staple of the modern jazz repertoire and a rite of passage for every ...\nGuide\nJazz Advice and Tips\nPremium\nBlues\nCharlie Parker\nUse the Power of Imitation to Unlock  Jazz Improvisation\nAs players today, we have a ton of resources to draw from in the practice room. But when it comes to the more musical areas of improvisation, something is missing. ...\nJazz Advice and Tips\nJazz Language\nThelonious Monk\nBrowse Lessons\nWhere to Start\nJazz Courses For All Levels\nHow Tunes Really Work\nJazz Theory Unlocked\nOur latest offering is a video lecture series that will give you a strong understanding of harmony and teach you the\nWHY\nbehind everything in jazz. If you want to make sense of music theory on a deep level, this course is for you.\nStart Unlocking Theory\nhear like a pro\nThe Ear Training Method\nThis audio course is an in-depth ear training program designed to quickly improve your ear. Inside you'll learn to break free from the written page and play the music you hear. In the process you'll master the sounds of intervals, chords, voicings, chord-tones, progressions and more!\nStart Training Your Ear\nJazz Language Secrets\nMelodic Power\nThis is a powerful Video & eBook course for all levels, that will guide you through the nuts-and-bolts of how to improvise strong melodies on the most common chords. You'll learn dozens of powerful melodic techniques on all the primary chords types.\nStart Getting Language\nTrain Your Brain\nVisualization for Jazz Improvisation\nIn this course, you'll discover techniques to mentally master chord symbols, chord tones and common progressions on a deeper level than ever before. Learning to visualize is a crucial step for every jazz improviser, helping them to memorize tunes more easily and think more clearly about chords and progressions.\nStart VISUALIZing\nMaster Your Mind\nReprogramming The Musical Mind\nThis 30 day audio course for every musician will reprogram your mind to reach your optimal creative state as a musician. If you've ever battled with stage fright, self worth, motivation, or just want to feel inspired about playing again, this course will get you there.\nStart Reprogramming\nSee All Courses\nWho is Jazzadvice?\nWe’re Forrest & Eric.\nWe’ve learned from a ton of great players like Mulgrew Miller, Rich Perry, and Harold Mabern, and now it’s our mission to teach you.\nForrest Wernick\nSaxophone\nFrom the Bay Area, he's lived in California, Colorado, and New York, learning and playing music. He's studied extensively with Rich Perry, Mulgrew Miller, and a lot of other amazing musicians. When he's not playing saxophone, you can find him traveling, boxing, and training in Muay Thai.\nMore about Forrest\nEric O'Donnell\nTrumpet\nOriginally from Northeast Ohio, he moved to New York/New Jersey to go to graduate school. He's studied with greats such as Bill Mobley, Mulgrew Miller, Ingrid Jensen, and many more. In his free time he's usually working out, reading, or training for a marathon.\nMore about Eric\nPremium Lessons\nPremium Members\nget access to special lessons and help keep Jazzdavice alive\nMastering Forward Motion in Jazz Improvisation\nWhen you first start learning to improvise, the focus is often on which notes work over a chord…which scale to play, finding the key, or memorizing chord symbols. But over ...\nPlaying Techniques\nPremium\nBill Evans: 4 Tools for Creating Harmonic Motion\nFor any improviser learning jazz standards, one of the greatest challenges isn’t just learning the chords to a tune – it’s making music with them when you take a solo. ...\nChords\nJazz Musicians\nJazz Standards\nPremium\nBill Evans\nBird Blues: A Player’s Guide\nCharlie Parker’s iconic take on the Blues form, commonly referred to as the “Bird Blues,” is a staple of the modern jazz repertoire and a rite of passage for every ...\nGuide\nJazz Advice and Tips\nPremium\nBlues\nCharlie Parker\nMore about Premium\nWhat do you want to Focus on?\nEar Training\nDeveloping your ear leads to improvisational freedom\nTranscribing\nLearning from the masters is the key to learning jazz quickly\nJazz Standards\nStudying the classic jazz repertoire is essential for everyone\nWhat to Practice\nDeveloping good practice habits leads to great results\nJazz Language\nAcquiring jazz language is fundamental to improvising\nMusic Theory\nUnderstanding harmony on a deep level is crucial\nJoin 100,000+ JA subscribers\nIf your goal as a jazz musician is to get better fast and have fun doing it, then make sure to\njoin over 100K Jazzadvice subscribers\nby signing up to our\nFREE\nnewsletter. Each week, we'll send you powerful resources to keep you moving forward in your jazz journey.\nSubscribe\nARE YOU READY TO TAKE YOUR PLAYING TO THE\nNEXT LEVEL\nAS FAST AS HUMANLY POSSIBLE??\nClick the lovely button below to get started\nI'm Ready to Improve Fast\nJazz Lessons\nStart Here\nBrowse Lessons\nPremium Lessons\nGet Premium\nTools for Musicians\nCourses\nJazz Theory\nMelodic Power\nEar Training Method\nVisualization\nReprogramming\nCategories\nTranscribing\nJazz Language\nMusic Theory\nJazz Standards\nEar training\nConnect\nJoin Newsletter\nFacebook\nTwitter\nAbout Us\nContact Us\n©2025 Jazzadvice. All rights reserved\nPrivacy Policy\n|\nTerms of Use\nClose\nHome\nLessons\nStart Here\nBrowse Lessons\nPremium Lessons\nJazz Courses\nJoin Premium\nConnect\nNewsletter\nContact Us\nAbout Us\nLog in"
  },
  {
    "source": "https://tonesavvy.com/",
    "content": "ToneSavvy | Music Theory & Ear Training\nToggle navigation\nExercises\nMusic Theory\nNote Names\nInterval Identification\nInterval Building\nChord Identification\nChord Building\nChord Functions\nPaced Note Names\nRhythm Dictation\nRhythm Performance\nKey Signatures\nScale Building\nPiano Keys\nGuitar Frets\nViolin Fingerboard\nViola Fingerboard\nCello Fingerboard\nDouble Bass Fingerboard\nFirst Species Counterpoint\nEar Training\nIntervals\nChords\nScales\nChord Progressions\nPerfect Pitch\nScale Degrees\nIntervals in Context\nMelodic Dictation\nUse in your classroom\nLog In\nTeach and learn music theory from anywhere.\nUse the exercises in your class\nTeaching Music?\nAs a subscriber to ToneSavvy.com you can manage your student list, give out carefully tailored assignments, and check your students' scores, all online.\nYour students can complete their assignments from any computer or mobile device through the web.\nSubscribe now!\nStudying Music?\nIf your teacher gave you a username and teacher code to use here,\nsign in for your assignments\n.\nIf not, you can still use the\nfree exercises\nto practice your skills. For best results, practice a little bit every day.\nThe Exercises\nChoose from a broad range of exercises to focus on specific skills. Here are some of our most popular exercises:\nNote names (sight reading)\n: Practice sight reading by identifying the names of notes displayed on the staff.\nInterval Building\n: Practice building intervals by placing notes on the staff.\nChord Identification\n: Practice identifying chords displayed on the staff.\nPractice all of the exercises for free\nhere\n.\nEar Training Practice\nThese exercises will improve your musical ability by developing a more intuitive understanding of what you hear.\nIntervals\n:\nIn this exercise, you will hear two notes in sequence. Your goal is to identify the interval between the two notes.\nChords\n:\nIn this exercise, you will hear a chord. Your goal is to identify the type of chord that you heard.\nScales\n:\nIn this exercise, you will hear a scale. Your goal is to identify the name of the scale that you heard.\nChord Progressions\n:\nIn this exercise, you will hear a chord progression. Your goal is to identify each chord that you heard.\nPerfect Pitch\n:\nIn this exercise, you will hear a single note. Your goal is to identify the name of the note.\nScale Degrees (functional)\n:\nIn this exercise, you will hear a short chord progression followed by a single note. You must identify the scale degree of that note relative to the key established by the chord progression. This is also known as \"functional ear training\".\nIntervals in Context (functional)\n:\nThis exercise combines the \"Intervals\" and \"Scale Degrees\" exercises. In this exercise, you will hear a short chord progression followed by two notes. You must identify the major scale degrees of the two notes relative to the key established by the chord progression as well as the interval between the two notes.\nMelodic Dictation\n:\nIn this exercise, you will hear a short chord progression followed by a short melody. You must identify the major scale degree of each note in the melody.\nMusic Theory Practice\nThese exercises will improve your understanding of music concepts and your speed at interpreting from the staff.\nNote Names\n:\nIdentify the names of notes that appear on the staff.\nInterval Building\n:\nBuild intervals on the staff. Given a starting note and the name of an interval, can you place the second note?\nInterval Identification\n:\nIdentify intervals on the staff.\nChord Building\n:\nBuild triads and 7th chords on the staff. Challenge yourself with different inversions!\nChord Identification\n:\nIdentify triads and 7th chords on the staff. This game helps you identify 3- and 4-note chords and their inversions quickly on sight.\nChord Functions:\nBuild chords based on a key and chord function.\nPaced Note Names\n:\nIdentify the notes sliding across the staff before they disappear into oblivion!\nRhythm Dictation\n:\nNotate rhythmic patterns based on what you hear using whole notes, half notes, quarter notes, and eighth notes, depending on difficulty level.\nRhythm Performance\n:\nTap out the rhythm displayed on the staff.\nKey Signature Identification\n:\nIdentify the key signature that appears on the staff.\nScale Building\n:\nBuild scales on the staff. Includes modes (Ionian, Dorian, Phrygian...) as well as other scales.\nPiano Keys\n:\nIdentify the notes on the staff by clicking the proper key on an on-screen piano keyboard.\nLearn More:\nTry the exercises\nUse the exercises in your class\nHome\n⋅\nContact\n⋅\nAbout\n⋅\nPrivacy Policy\n⋅\nTerms of Service"
  },
  {
    "source": "https://www.earmaster.com/",
    "content": "The #1 App for Ear Training, Sight-Singing, and Rhythm - EarMaster\nMobile Menu Toggle\nProducts\nEar Training, Sight-Singing, Rhythm, and Music Theory\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nFree Tools\nInterval Song Chart Tool\nMusic Theory Online Course\nBuy Now\nDownload\nSupport\nKnowledge Base\nFrequently Asked Questions\nSupport Forum\nTutorials\nSupport Toolbox\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nEarMaster Cloud\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nCommunity\nForum\nBecome an Affiliate\nNewsletter Signup\nBlog\nCompany\nContact\nAbout EarMaster\nWork at EarMaster\nPress Material\nBecome a Reseller\nCloud Login\nMobile Menu Toggle\nProducts\nEar Training, Sight-Singing, Rhythm, and Music Theory\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nFree Tools\nInterval Song Chart Tool\nMusic Theory Online Course\nBuy Now\nDownload\nSupport\nKnowledge Base\nFrequently Asked Questions\nSupport Forum\nTutorials\nSupport Toolbox\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nEarMaster Cloud\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nCommunity\nForum\nBecome an Affiliate\nNewsletter Signup\nBlog\nCompany\nContact\nAbout EarMaster\nWork at EarMaster\nPress Material\nBecome a Reseller\nCloud Login\nEarMaster Makes You a Better Musician\nThe leading app for ear training, sight-singing & rhythm training\n4000 exercises for all levels: intervals, scales, chords, cadences, melodies, rhythm, sight-singing - It's all there!\nThe perfect choice for music students, hobbyists and professionals who want to improve their musical skills.\nBuilt-in courses for ABRSM Aural, RCM Voice, Solfege, etc.\nEasy to use, motivating, and extremely efficient!\nReady to boost your musical skills? Let's go!\nDownload\nBuy now\nTeaching Music?\nDiscover our all-in-one educational solution\nEarMaster Cloud\nSerious about your musical skills? Use the best app to improve them!\nWhen it comes to your musical skills, don't settle. EarMaster is the leading app for ear training, sight-singing practice and rhythm training, used by some of the best music schools, and developed in close partnership with recognized music teachers. It will help you reach your music goals with thousands of motivating and effective exercises for all skill levels.\nEar training\nEarMaster is not just the best ear training app and software you can get, it's also the most complete! It will train you to hear and recognize\nmelodies, scales, intervals, chords, chord inversions, chord progressions, rhythm and cadences\n. You will be better at playing by ear, transcribing and improvising in no time!\nSight-Singing\nTraining your sight-singing skills has never been so fun and effective. With EarMaster, you can\nsing musical scores\nand obtain an instant evaluation of your pitch and rhythmic accuracy. You will make much faster progress than by training on your own without any clue whether you're on pitch or not.\nRhythm training\nTo be a great musician, you need\nsolid rhythmic skills\n. EarMaster's rhythmic workshops for all levels will help you improve your timing with motivating sight-reading, clap-back, dictation and error-detection exercises. You can perform rhythms by tapping on your device, or by clapping your hands into a microphone.\nMonitor your progress\nEarMaster offers detailed\nresult monitoring\nto review your progress lesson by lesson, day after day, and identify your strengths and weaknesses. Should you find areas that demand extra work, you can easily configure your own exercises in order to focus on the intervals, chords, scales or rhythms of your choice.\nSing and clap your answers\nIn most of the exercises, you can\nsing or clap your answers\n. For instance, the Melody Sing-back and Rhythm Clap-back exercises are exciting call-and-response activities where you sing or clap back what you hear. After you have sung or clapped, EarMaster will tell you which notes were on pitch, on time, slightly off, or wrong. Try it, it's really fun!\nFunctional ear training\nEach note has a specific function within a key. To describe that function, you can use numbers (scale degrees), solfege syllables (Do-Re-Mi-Fa-So-La-Ti), or you can use describing terms (Tonic, Supertonic, Mediant, etc.). In EarMaster, you can do\nfunctional ear training\nby using the built-in\nfunctional keyboard\nin combination with the \"Play tonic of key\" option in\nCustomized Exercise\nmode.\nCloud sync\nWith\npersonal\nand\nschool subscriptions\n, you can use EarMaster on any computer, phone or tablet running Windows, macOS, Android or iOS, and sync your results and settings across them. Notice: this is not included with a serial number for PC/Mac or in-app purchases.\nAI Inside\nWe injected some AI into EarMaster: the app analyzes your performance in real-time and\nadapts the content and the length of the current exercise\naccordingly. If you are doing really well, the lesson will stop early, but if you are struggling a bit, it will be extended with additional questions to make sure that you fully grasp the current topic.\nJazz exercises\nIf you're looking for\nJazz ear training\n, EarMaster is the way to go! Its 9 workshops dedicated to Jazz and Blues cover topics such as «Blues Scales and Blues Songs», «1920's American Swing Hits», «Ballads and Blues in Minor», «Novelty Songs and Rhythms», «Irish Ballads and Folk Music», and «Fun with Irving Berlin», as well as Jazz harmony and Swing rhythm.\nMore features\nVersion for education\nDownload\nUsed by leading music schools in most countries\nand many more...\nProducts\nFor musicians\nFor schools\nLicense Comparison\nInterval Song Chart Maker\nOnline Music Theory\nHelp\nTutorials\nFAQ\nSerial Number Recovery\nCloud Login Recovery\nCommunity\nContact us\nForum\nBecome an Affiliate\nBecome an Early Adopter\n© EarMaster 2025. All rights reserved\nSwitch language\nPrivacy Policy\n|\nTerms and Conditions\nMobile Menu Toggle\nProducts\nEar Training, Sight-Singing, Rhythm, and Music Theory\nEarMaster for All Musicians\nEarMaster Cloud for Education\nLicense Comparison\nFree Tools\nInterval Song Chart Tool\nMusic Theory Online Course\nBuy Now\nDownload\nSupport\nKnowledge Base\nFrequently Asked Questions\nSupport Forum\nTutorials\nEarMaster Cloud\nGuides for Students\nGuides for Teachers\nGuides for Administrators\nSupport Toolbox\nSerial Number Recovery\nRegister Your License\nEarMaster Cloud Login Recovery\nCommunity\nForum\nBecome an Affiliate\nNewsletter Signup\nBlog\nCompany\nContact\nAbout EarMaster\nWork at EarMaster\nPress Material\nBecome a Reseller\nCloud Login\nMastodon"
  },
  {
    "source": "https://www.premierguitar.com/",
    "content": "403 Forbidden\nError 403 Forbidden\nForbidden\nError 54113\nDetails: cache-chi-klot8100105-CHI 1754002204 688823288\nVarnish cache server"
  },
  {
    "source": "https://viva.pressbooks.pub/openmusictheory/",
    "content": "Open Music Theory – Simple Book Publishing\n\"\nSkip to content\nMenu\nPrimary Navigation\nHome\nRead\nSign in\nSearch in book:\nSearch\nWant to create or adapt books like this?\nLearn more\nabout how Pressbooks supports open publishing practices.\nBook Title:\nOpen Music Theory\nSubtitle:\nVersion 2\nby Mark Gotham; Kyle Gullings; Chelsey Hamm; Bryn Hughes; Brian Jarvis; Megan Lavengood; and John Peterson\nEdited by Erin K. Maher\nDownload this book\nDigital PDF\nPressbooks XML\nBook Description:\nOpen Music Theory\nis a natively-online open educational resource intended to serve as the primary text and workbook for undergraduate music theory curricula.\nOMT2\nprovides not only the material for a complete traditional core undergraduate music theory sequence (fundamentals, diatonic harmony, chromatic harmony, form, 20th-century techniques), but also several other units for instructors who have diversified their curriculum, such as jazz, popular music, rhythm, counterpoint, and orchestration. This version also introduces a complete workbook  of assignments.\nAdoption Form\nFeedback\nLicense:\nCreative Commons Attribution ShareAlike\nRead Book\nShare on X\nShare on LinkedIn\nShare via Email\nContents\nShow All Contents\nHide All Contents\nBook Contents Navigation\nIntroduction\nFeatures\nVersion 2\nAccessibility\nUpdates\nResources and Community for Instructors\nAcknowledgments\nAuthorship\nContributors\nArtwork\nFinancial Support\nStatement on Spotify Usage\nInstructor Resources\nChangelog\nSummer 2024\nSummer 2023\nSummer 2022\nFür Deutschsprachige\nPour les francophones\nI. Fundamentals\nIntroduction to Western Musical Notation\nChelsey Hamm\nNotation of Notes, Clefs, and Ledger Lines\nChelsey Hamm\nNotation of Notes\nStaff Notation\nPlacing Notes on a Staff\nStems and Beams\nDrawing Seconds\nClefs\nDrawing Clefs\nWriting Ledger Lines\nReading Clefs\nChelsey Hamm\nClefs and Ranges\nReading Treble Clef\nReading Bass Clef\nReading Alto Clef\nReading Tenor Clef\nOther C Clefs\nLedger Lines\nNeutral Clef\nThe Keyboard and the Grand Staff\nChelsey Hamm\nThe Piano Keyboard\nPlaying the Piano\nOctave Equivalence and White Key Letter Names on the Piano Keyboard\nThe Grand Staff\nGeneric Intervals (Interval Size)\nHalf Steps, Whole Steps, and Accidentals\nChelsey Hamm\nHalf Steps and Whole Steps\nSharps, Flats, and Naturals\nThe Black Keys on the Piano Keyboard\nEnharmonic equivalence\nAmerican Standard Pitch Notation (ASPN)\nChelsey Hamm and Bryn Hughes\nAmerican Standard Pitch Notation and Pitch versus Pitch Class\nASPN and Octave Designations\nASPN and the Keyboard\nASPN and Staff Notation\nOther Aspects of Notation\nMark Gotham and Chelsey Hamm\nDynamics\nArticulations\nTempo\nStructural Features\nStylistic Periods\nNotating Rhythm\nMark Gotham; Chelsey Hamm; and Bryn Hughes\nNote Values\nRest Values\nDots and ties\nSimple Meter and Time Signatures\nMark Gotham; Chelsey Hamm; and Kris Shaffer\nTerminology\nListening to Simple Meters\nConducting Patterns\nTime Signatures\nCounting in Simple Meter\nCounting with Beat Units of 2, 8, and 16\nBeaming, Stems, Flags, and Multi-Measure Rests\nA Note on Ties\nCompound Meter and Time Signatures\nMark Gotham and Chelsey Hamm\nListening to and Conducting Compound Meters\nTime Signatures\nCounting in Compound Meter\nCounting with Division Units of 4 and 16\nBeaming, Stems, and Flags\nOther Rhythmic Essentials\nMark Gotham; Chelsey Hamm; and Bryn Hughes\nBorrowed Divisions\nA Brief Introduction to Hypermeter\nSyncopation\nMajor Scales, Scale Degrees, and Key Signatures\nChelsey Hamm and Bryn Hughes\nMajor Scales\nScale Degrees, Solfège, and Scale-Degree Names\nKey Signatures\nThe Circle of Fifths\nMinor Scales, Scale Degrees, and Key Signatures\nChelsey Hamm and Bryn Hughes\nThe Minor Scale\nNatural Minor\nHarmonic Minor\nMelodic Minor\nMinor Scale Degrees, Solfège, and Scale-Degree Names\nThe Parallel and Relative Relationships\nMinor Key Signatures\nMinor Keys and the Circle of Fifths\nMajor or Minor?\nIntroduction to Diatonic Modes and the Chromatic Scale\nChelsey Hamm\nModes and the Parallel Relationship\nThe Pentatonic Collection\nChromatic Scales\nThe Basics of Sight-singing and Dictation [crosslist]\nIntervals\nChelsey Hamm and Bryn Hughes\nSize\nPerfect, Major, and Minor Qualities\nThe “Major Scale” Method for Determining Quality\nAugmented and Diminished Qualities\nDoubly and Triply Augmented and Diminished Intervals\nCompound Intervals\nIntervallic Inversion\nConsonance and Dissonance\nAnother Method for Intervals: The White-Key Method\nIntervallic Enharmonic Equivalence\nTriads\nChelsey Hamm\nTriads\nTriadic Qualities and Listening to Triads\nChord Symbols\nTriad Qualities in Major and Minor\nSpelling Triads\nIdentifying Triads, Doubling, and Spacing\nSeventh Chords\nChelsey Hamm\nSeventh Chords\nSeventh Chord Qualities and Nomenclature\nListening to Seventh Chords\nSeventh Chord Qualities in Major and Minor\nSpelling Seventh Chords\nIdentifying Seventh Chords, Doubling, and Spacing\nInversion\nSamuel Brady and Chelsey Hamm\nTriadic Inversion\nSpelling Triads in Inversion\nIdentifying Triads in Inversion\nSeventh Chord Inversion\nSpelling Seventh Chords in Inversion\nIdentifying Seventh Chords in Inversion\nRoman Numerals\nSamuel Brady; Chelsey Hamm; Megan Lavengood; and Kris Shaffer\nRoman Numerals and Quality\nRoman Numerals for Seventh Chords\nRoman Numeral Analysis\nTexture\nMark Gotham and Samuel Brady\nMonophony\nHeterophony\nHomophony\nPolyphony\nChords in SATB style\nSamuel Brady\nStem Direction\nChord Construction\nRange\nSpacing\nVoice Crossing\nDoubling\nII. Counterpoint and Galant Schemas\nIntroduction to Species Counterpoint\nMark Gotham and Kris Shaffer\nConsonance and dissonance\nTypes of motion\nComposing a Cantus Firmus\nRules for melodic and harmonic writing\nThe Psychology of Counterpoint\nFirst-Species Counterpoint\nMark Gotham and Kris Shaffer\nThe Counterpoint Line\nBeginning and Ending\nIndependence of the Lines\nIntervals and Motion\nSecond-Species Counterpoint\nMark Gotham and Kris Shaffer\nThe Counterpoint Line\nBeginning and Ending\nStrong Beats\nWeak Beats\nDemonstration\nThird-Species Counterpoint\nMark Gotham and Kris Shaffer\nThe Counterpoint Line\nBeginning and Ending\nStrong Beats\nOther Beats\nConsonance\nDissonance\nFourth-Species Counterpoint\nMark Gotham and Kris Shaffer\nThe Suspension\nThe Fourth-Species Counterpoint Line\nBeginning and Ending\nDemonstration\nFifth-Species Counterpoint\nMark Gotham and Kris Shaffer\nBeginning and Ending\nEmbellishing Suspensions\nGradus ad Parnassum Examples\nGradus ad Parnassum Exercises\nMark Gotham\nView Online and/or Download\nGradus ad Parnassum Data\n16th-Century Contrapuntal Style\nMark Gotham\nImitation\nMelody\nRhythm and Meter\nText Setting\nTexture\nHarmony\nHigh Baroque Fugal Exposition\nMark Gotham\nBasic Definitions\nStructure / Voice Entries\nSubject\nAnswer\nCountersubject\nFree Counterpoint\nLinks\nGeneral Matters\nExample\nGround Bass\nMark Gotham\nMultiple Harmonizations of a Given Bass\nAnalysis: Purcell’s Sonata in G Minor (Z 807)\nGalant Schemas\nMark Gotham and Kris Shaffer\nOpening Gambits Such as the Meyer\nClosing Gestures Such as the Prinner\nOther\nGalant Schemas – Summary\nMark Gotham\nOverall Short Summary\nItemized List\nGalant schemas – The Rule of the Octave and Harmonizing the Scale with Sequences\nMark Gotham\nThe Rule of the Octave\nHarmonizing the Scale with Sequences\nIII. Form\nFoundational Concepts for Phrase-Level Forms\nJohn Peterson\nHierarchy\nMotives\nThe Idea Level, the Phrase, and Segmentation Analysis\nThe Phrase, Archetypes, and Unique Forms\nJohn Peterson\nThe Phrase\nTwo Categories: Archetypes vs. Unique Forms\nArchetype 1: The Sentence (A Special Kind of Phrase)\nArchetype 2: The Period (A Combination of Two Phrases)\nThe Repeated Phrase (Another Way to Combine Two Phrases)\nCompound Phrase-Level Forms (Combining Archetypes)\nUnique Phrase-Level Forms\nHybrid Phrase-Level Forms\nJohn Peterson\nWhat’s a hybrid form?\nBeginnings\nEndings\nHybrid Possibilities and Examples\nListening to Phrase-level Forms\nExpansion and Contraction at the Phrase Level\nJohn Peterson\nInternal Expansions\nExternal Expansions\nContraction\nFormal Sections in General\nBrian Jarvis\nOverview of Formal Sections in General\nCore Sections\nAuxiliary Formal Sections\nExternal Auxiliary Sections\nConnective Auxiliary Sections\nBinary Form\nBrian Jarvis\nRepeat Structure and Types of Binary Form\nRounded Binary Form\nSimple Binary Form\nBalancing a Binary Form\nHarmonic Expectations\nTernary Form\nBrian Jarvis\nStructure of Individual Sections (Simple vs. Compound)\nContrasting Characteristics of B\nStability of Each Section\nKeys and Harmony\nAuxiliary Sections\nExample Analyses\nSonata Form\nBrian Jarvis\nExposition\nDevelopment\nRecapitulation\nSimilarity to Binary Form\nAdditional Sonata Terminology: MC, EEC, ESC\nExternal Auxiliary Sections: Introduction and Closing Area\nSonata Form Analysis Example\nRondo\nBrian Jarvis\nRefrains, Episodes, and Auxiliary Sections in Rondo Form\nFive-Part Rondo Example\nSonata Rondo Example\nIntroduction to Form in Popular Music [crosslist]\nAABA and Strophic Form [crosslist]\nVerse-Chorus Form [crosslist]\nIV. Diatonic Harmony, Tonicization, and Modulation\nIntroduction to Harmony, Cadences, and Phrase Endings\nJohn Peterson\nIntroduction to Harmony\nIntroduction to Cadences\nAuthentic Cadences (they sound conclusive!)\nHalf Cadences (they sound inconclusive!)\nCadential Strength and the IAC\nHearing Cadences\nWriting Authentic Cadences (with triads only)\nWriting Half Cadences (using I and V only)\nStrengthening Endings with V⁷\nJohn Peterson\nThe Default Resolution of V7 to I\nAlternative Resolutions of V7 to I\nSummary\nStrengthening Endings with Strong Predominants\nJohn Peterson\nWriting with ii6\nWriting with IV\nRoot position ii\nUsing IV and ii(6) in combination\nEmbellishing Tones\nJohn Peterson\nOverview\nCategory 1: Embellishing tones that move by step\nCategory 2: Embellishing tones that involve a leap\nCategory 3: Embellishing tones involving static notes\nSummary\nStrengthening Endings with Cadential 6/4\nJohn Peterson\nLabeling cadential 6/4\nWriting with cadential 6/4\nProlonging Tonic at Phrase Beginnings with V⁶ and Inverted V⁷s\nJohn Peterson\nOverview\nWriting Tonic Prolongations\nCombining Progressions\nBass Line Summary\nPerforming Harmonic Analysis Using the Phrase Model\nJohn Peterson\nOverview\nPerforming a Harmonic Analysis\nIdentifying the Phrase Model in Harmonic Analysis\nProlongation at Phrase Beginnings using the Leading-Tone Chord\nJohn Peterson\nOverview\nSubstituting the leading-tone chord in place of V(7)\nviio4/2\nUsing the leading-tone chord as a half-diminished seventh chord\n6/4 Chords as Forms of Prolongation\nJohn Peterson\nSummary: 6/4 chord types\nPlagal Motion as a Form of Prolongation\nJohn Peterson\nWriting plagal motion after an authentic cadence\nWriting plagal motion at a phrase beginning\nLa (6̂) in the Bass at Beginnings, Middles, and Endings\nJohn Peterson\nOverview: uses of la (scale degree 6)\nAt phrase beginnings\nAt phrase middles\nAt phrase endings\nThe Mediant Harmonizing Mi (3̂) in the Bass\nJohn Peterson\nOverview: the iii chord\nWriting with iii\nPredominant Seventh Chords\nJohn Peterson\nAdding a chordal seventh to ii\nOther predominant sevenths\nDiatonic Sequences in Middles\nJohn Peterson\nOverview\nDescending sequences\nAscending sequences\nWriting sequences\nTonicization\nMegan Lavengood and John Peterson\nTonicizing V\nTonicizing chords other than V\nTonicized deceptive motion\nAdding tonicization to diatonic progressions\nSecondary dominants as altered diatonic chords\nExtended Tonicization and Modulation to Closely Related Keys\nJohn Peterson\nAnalyzing Modulations\nWriting modulations with pivot chords\nTonicization versus modulation\nV. Chromaticism\nModal Mixture\nBrian Jarvis\nCommon Progressions\nUsing Modal Mixture\nPicardy Third\nLarge-Scale Modal Mixture\nMusical Examples\nNeapolitan Sixth Chords (♭II⁶)\nBrian Jarvis\nContext\nVoice Leading\nAssociated Progressions\nAugmented Sixth Chords\nBrian Jarvis\nBrief Overview\nContext\nConnection to the lament-bass progression\nRecognizing augmented sixth chords when analyzing\nThe German Diminished Third Chord\nMusical Example\nCommon-Tone Chords (CTᴼ⁷ & CT⁺⁶)\nBrian Jarvis\nDeriving a CTo7 chord from multiple neighbor tones\nCreating a CTo7 chord\nRecognizing CTo7 when analyzing\nResolving CTo7 to V7\nCTo7 with incomplete neighbors\nCreating a CT+6 chord\nMusical Examples\nHarmonic Elision\nBrian Jarvis\nContext\nRaised-Root Elision\nFinding Harmonic Elision\nMusical Example\nChromatic Modulation\nBryn Hughes\nChromatic Modulation\nEnharmonic Reinterpretation\nReinterpreting Diminished-Seventh Chords\nAugmented Options\nMark Gotham\nEqual Divisions of the Octave\nBryn Hughes\nChromatic Sequences\nBryn Hughes\nDescending-Fifths Sequence\nAscending 5–6 Sequence\nDescending 5–6 Sequence\nParallel 6/3 Chords\nAdvanced Variations on the Chromatic Descending-Fifths Sequence\nThe Omnibus Progression\nBryn Hughes\nThe converging omnibus progression\nThe diverging omnibus progression\nAltered and Extended Chords\nBryn Hughes\nAltered Chords\nExtended Chords\n“Fake” Extensions vs. “Real” Extensions\nNeo-Riemannian Triadic Progressions\nBryn Hughes\nNeo-Riemannian Transformations\nThe Tonnetz\nChains or Cycles of Transformations\nOther Transformations\nMore Networks of Neo-Riemannian Transformations\nMediants\nMark Gotham\nDiatonic Mediants (Grade 1)\nChromatic Mediants (Grade 2)\nDoubly-Chromatic Mediants (Grade 3)\nSummary\nFunction and Transformations\nAn Example\nVI. Jazz\nSwing Rhythms\nMegan Lavengood\nThe Basic Swing Groove\nSyncopation\nChord Symbols\nMegan Lavengood\nBasics of Chord Symbols\nExtensions\nAdded Notes (add) and Suspensions (sus)\nChord Symbols vs. Roman Numerals\nJazz Voicings\nMegan Lavengood\nSpacing\nDoubling\nOmitting Notes\nSmooth Voice Leading\nJazz Voice Leading Paradigms\nii–V–I\nMegan Lavengood\nii–V–I as Schema\nApplied ii–Vs\nTurnarounds\nEmbellishing Chords\nMegan Lavengood\nEmbellishing Applied Chords\nCommon-Tone Diminished Seventh Chords (CTo7)\nRhythm and Embellishing Chords\nEmbellishing Chords in a Lead Sheet\nSubstitutions\nMegan Lavengood\nApplied Chords as Substitutions\nMode Mixture\nTritone Substitutions\nSubstitutions in a Lead Sheet\nChord-Scale Theory\nJohn Kocur\nBasic Chord-Scale Relationships\nChord-Scales and Major Keys\nApplying Chord-Scales to Progressions within a Key\nLimitations of Chord-Scale Theory\nBlues Harmony\nBryn Hughes and Megan Lavengood\n12-Bar Blues\nVoice leading\nMore Blues Schemas\nJazz Blues\nExamples of Variations\nBlues Melodies and the Blues Scale\nMegan Lavengood\nPhrase and Lyric Structure\nThe Blues Scale\nVII. Popular Music\nRhythm and Meter in Pop Music\nBryn Hughes; Megan Lavengood; and Kris Shaffer\nStraight Syncopation\nTresillo\nDrumbeats\nScott Hanenberg\nThe Acoustic Drum Kit\nFive-Line Staff Notation for Drum Kit\nThe Snare Drum and the Backbeat\nThe Kick Drum\nCymbals\nCompound Quadruple and Simple Triple Drumbeats\nMelody and Phrasing\nBryn Hughes and Megan Lavengood\nTwo-Part\nThree-Part\nFour-Part\nIntroduction to Form in Popular Music\nBryn Hughes and Megan Lavengood\nSections within Pop Forms\nTerminology and Basic Concepts\nAnalytical Notation\nAABA Form and Strophic Form\nBryn Hughes and Megan Lavengood\nStrophic Form\n32-Bar Song Form (AABA)\nSections of AABA and Strophic Forms\nRefrains\nVerse-Chorus Form\nBryn Hughes and Megan Lavengood\nSections within Verse-Chorus Form\nStandout Lyrics within Sections\nTexture in Pop Music\nMegan Lavengood\nExplicit Beat Layer\nFunctional Bass Layer\nMelodic layer\nHarmonic filler layer\nNovelty layer\nQuestions to ask while analyzing\nIntroduction to Harmonic Schemas in Pop Music\nBryn Hughes and Megan Lavengood\nBlues-Based Schemas\nBryn Hughes\nPlagal Motion\nMinor iv\nDouble-Plagal\nExtended Plagal\nRecognizing Blues-Based Schemas\nFour-Chord Schemas\nBryn Hughes and Megan Lavengood\nDoo-wop\nSinger/Songwriter\nHopscotch\nRecognizing by Ear\nClassical Schemas (in a Pop Context)\nBryn Hughes and Kris Shaffer\nLament\nCircle-of-Fifths\nPuff Schemas\nBryn Hughes and Megan Lavengood\nI–III♯–IV\nIII♯–IV as Deceptive Motion\nModal Schemas\nMegan Lavengood\nFunction of Modal Harmonies\nMixolydian: ♭VII\nAeolian: ♭VII and ♭VI\nDorian: IV with a Minor Tonic\nLydian: II♯\nIdentifying Modes by Ear\nPentatonic Harmony\nMark Gotham and Bryn Hughes\nFragile, Absent, and Emergent Tonics\nMegan Lavengood\nFragile tonic\nEmergent Tonics\nAbsent Tonics\nVIII. 20th- and 21st-Century Techniques\nTwentieth-Century Rhythmic Techniques\nSamuel Brady\nAsymmetrical Meter\nAmetric Music\nPerceived vs. Notated meter\nChanging Meter\nPolymeter\nMetric Modulation\nTimeline Notation\nFeathered Notes\nOstinato\nPitch and Pitch Class\nMegan Lavengood\nPitch\nPitch Class\nInteger Notation\nIntervals in Integer Notation\nMegan Lavengood and Brian Moseley\nPitch Intervals (ordered and unordered)\nOrdered Pitch-Class Intervals\nInterval Classes (IC)\nSummary\nPitch-Class Sets, Normal Order, and Transformations\nMegan Lavengood and Brian Moseley\nPitch-Class Sets\nNormal Order\nTransposition\nInversion\nUsing the Clock Face to Transpose and Invert\nSet Class and Prime Form\nMegan Lavengood and Brian Moseley\nIntroduction\nPrime Form\nThe Set Class Table\nInterval-Class Vectors\nBryn Hughes and Megan Lavengood\nMethod\nInterval-class vectors in analysis\nAnalyzing with Set Theory (or not!)\nMark Gotham and Megan Lavengood\nSegmentation\nRelationships Between Sets\nTheory Following Practice\nWhat Set Theory Won’t Tell You\nDiatonic Modes\nMark Gotham and Megan Lavengood\nChurch Modes\nDiatonic Modes in the 20th and 21st centuries\nModes in a Global Context\nCollections\nMark Gotham; Megan Lavengood; Brian Moseley; and Kris Shaffer\nDiatonic Collection and Pandiatonicism\nPentatonic Collection\nWhole-Tone Collection\nOctatonic Collection\nHexatonic Collection\nAcoustic Collection\nNew Ways of Organizing Pitch\nImportant Considerations with Collections\nAnalyzing with Modes, Scales, and Collections\nMark Gotham\nIn Theory\nIn Practice\nModes, Collections and Musical Meaning\nIX. Twelve-Tone Music\nBasics of Twelve-Tone Theory\nMark Gotham and Brian Moseley\nRows\nOperations\nEnter the Matrix\nFrom Theory to Practice\nNaming Conventions for Rows\nMark Gotham\nPitch\nRows\nMatrices\nRow Properties\nMark Gotham and Brian Moseley\nOverlapping Segments and the “All-Interval” Row\nDiscrete Segments and “Derived” Rows\n(Segmental) Invariance\nHexachords\n“Partially ordered” sets\nOther Special Types of Row Forms\nAnalysis Examples - Webern Op. 21 and 24\nMark Gotham\nWebern: Symphonie Op. 21 (1928)\nWebern: Konzert Op. 24 (1934)\nComposing with Twelve Tones\nMark Gotham\nChoosing Rows\nExample Compositions\nHistory and Context of Serialism\nMark Gotham\nWhy Serialism? What’s the Attraction?\nA Series of Precedents?\nThe Emergence and Evolution of the Twelve-Tone Technique\nX. Orchestration\nCore Principles of Orchestration\nMark Gotham\nSimultaneous (Vertical) Combinations\nSuccessive (Horizontal) Combinations\nSubtle Color Changes\nMark Gotham\nFor a timbral cadence\nTo finesse a structural boundary\nFor the “attack-sustain” (“resonance”) effect\nFor a seamless orchestral crescendo\nFor timbrally nuanced melodies\nTranscription from Piano\nMark Gotham\nBasic Principles\nTranscription Case Studies\nXI. Rhythm and Meter\nNotating Rhythm [crosslist]\nSimple Meter and Time Signatures [crosslist]\nCompound Meter and Time Signatures [crosslist]\nOther Rhythmic Essentials [crosslist]\nHypermeter\nMark Gotham\nHypermeter in 3s: “ritmo de tre battute”\nHypermeter in (Performance) Practice\nAdditional Levels of 3s at the Fast End?\nSensible Limits and the Psychology of Meter\nNot Limited, and Perhaps Not So Sensible Either\nMetrical Dissonance\nMark Gotham and Megan Lavengood\nDisplacement Dissonance\nGrouping dissonance\nChanging Dissonance\nDisplacement Dissonance\nGrouping dissonance\nChanging Dissonance\nSwing Rhythms [crosslist]\nRhythm and Meter in Pop Music [crosslist]\nDrumbeats [crosslist]\nTwentieth-Century Rhythmic Techniques [crosslist]\nAnthology\nHarmony Anthology\nMeter Anthology\nMark Gotham\nTwelve-Tone Anthology\nMark Gotham\nTabular List\nMusical Notation\nAnthology\nWorkbook\nDigital Workbook\nKyle Gullings\nPDF Workbook\nKyle Gullings\nEar Training Appendix\nThe Basics of Sight-Singing and Dictation\nSamuel Brady; Chelsey Hamm; and Kris Shaffer\nStrategies for Sight-Singing and Sight-Counting\nStrategies for Dictation\nProtonotation\nExamples for Sight-counting and Sight-singing: Level 1\nChelsey Hamm and Levi Langolf\nSection 1\nSection 2\nSection 3\nExamples for Sight-counting and Sight-singing: Level 2\nChelsey Hamm and Levi Langolf\nSection 4\nSection 5\nSection 6\nChapters in Development\nGraphic Notation and Scores\nZach Gist and Chelsey Hamm\nA Brief History of Graphic Notation\nIndeterminacy and John Cage\nInterpreting Graphic Scores without Instructions\nInterpreting Graphic Scores with Instructions\nMeasuring Time and Hybrid Scores\nGlossary\nSuggestions and Feedback\nHelpful documents\nStaff paper\nTechnology\nSet Theory\nTable of Set Classes\nBook Information\nBook Description\nOpen Music Theory Version 2 (OMT2)\nis an open educational resource intended to serve as the primary text and workbook for undergraduate music theory curricula. As an open and natively-online resource,\nOMT2\nis substantially different from other commercially-published music theory textbooks, though it still provides the same content that teachers expect from a music theory text.\nOMT2\nhas been designed inclusively. For us, this means broadening our topics beyond the standard harmony and atonal theory topics to include fundamentals, musical form, jazz, pop, rhythm, and orchestration. And within those traditional sections of harmony and atonal theory, the authors have deliberately chosen composers who represent diverse genders and races. The book is accessible. And perhaps most importantly, the book is completely free and always will be.\nThe text of the book is augmented with several different media: video lessons, audio, interactive notated scores with playback, and small quizzes are embedded directly into each chapter for easy access.\nOMT2\nintroduces a full workbook to accompany the text. Almost every chapter offers at least one worksheet on that topic. Some chapters, especially in the Fundamentals section, also collect additional assignments that can be found on other websites.\nVersion 2 of this textbook is collaboratively authored and edited by Mark Gotham, Kyle Gullings, Chelsey Hamm, Bryn Hughes, Brian Jarvis, Megan Lavengood, and John Peterson.\nAuthors\nMark Gotham; Kyle Gullings; Chelsey Hamm; Bryn Hughes; Brian Jarvis; Megan Lavengood; and John Peterson\nLicense\nOpen Music Theory\nCopyright © 2023 by\nMark Gotham; Kyle Gullings; Chelsey Hamm; Bryn Hughes; Brian Jarvis; Megan Lavengood; and John Peterson\nis licensed under a\nCreative Commons Attribution-ShareAlike 4.0 International License\n, except where otherwise noted.\nSubject\nTheory of music and musicology\nMetadata\nTitle\nOpen Music Theory\nAuthors\nMark Gotham; Kyle Gullings; Chelsey Hamm; Bryn Hughes; Brian Jarvis; Megan Lavengood; and John Peterson\nEditor\nErin K. Maher\nContributors\nSamuel Brady; Scott Hanenberg; John Kocur; Levi Langolf; Brian Moseley; and Kris Shaffer\nLicense\nOpen Music Theory\nCopyright © 2023 by\nMark Gotham; Kyle Gullings; Chelsey Hamm; Bryn Hughes; Brian Jarvis; Megan Lavengood; and John Peterson\nis licensed under a\nCreative Commons Attribution-ShareAlike 4.0 International License\n, except where otherwise noted.\nPrimary Subject\nTheory of music and musicology\nAdditional Subject(s)\nArt music, orchestral and formal music, Music of film and stage, Popular music, Musical scores, lyrics and libretti, Techniques of music / music tutorials / teaching of music\nPublication Date\nJuly 1, 2021\nHashtag\n#openmusictheory\nPowered by\nPressbooks\nPressbooks User Guide\n|\nPressbooks Directory\n|\nContact\nPressbooks on YouTube\nPressbooks on LinkedIn"
  },
  {
    "source": "https://iconcollective.edu/basic-music-theory/",
    "content": "403 Forbidden\n403\nForbidden"
  },
  {
    "source": "https://www.musictheory.net/lessons",
    "content": "musictheory.net - Lessons\nOur lessons are provided online for free.\nIf they help you, please\npurchase our apps\nto support the site.\nTheory Lessons\nfor iPhone and iPad\nEnhanced offline versions of our animated lessons.\nTHE BASICS\nThe Staff, Clefs, and Ledger Lines\nLearn about the staff, treble and bass clefs, and ledger lines.\nNote Duration\nLearn about five types of notes and how flags affect note duration.\nMeasures and Time Signature\nLearn about measures and how many notes each can contain.\nRest Duration\nLearn about the different types of rest.\nDots and Ties\nLearn how dots and ties modify the duration of notes.\nSteps and Accidentals\nLearn about half steps, whole steps, and\nthe different types of\naccidentals.\nRHYTHM AND METER\nSimple and Compound Meter\nLearn how basic time signatures are classified.\nOdd Meter\nLearn about more complex time signatures.\nSCALES AND KEY SIGNATURES\nThe Major Scale\nLearn how to construct the major scale.\nThe Minor Scales\nLearn how to construct the three different types of minor scales.\nScale Degrees\nLearn the special names for each note of a scale.\nKey Signatures\nLearn about key signatures and the special ordering of accidentals.\nKey Signature Calculation\nLearn a method for mathematically calculating key signatures.\nINTERVALS\nGeneric Intervals\nLearn how two notes are measured on the staff.\nSpecific Intervals\nLearn how two notes are specifically measured.\nWriting Intervals\nLearn how to correctly spell intervals with a three-step process.\nInterval Inversion\nLearn how to invert intervals.\nCHORDS\nIntroduction to Chords\nLearn about the four types of triads.\nTriad Inversion\nLearn how to invert triads.\nSeventh Chords\nLearn about the five types of seventh chords.\nMore Seventh Chords\nLearn about three additional types\nof seventh chords\nused in popular music and jazz.\nSeventh Chord Inversion\nLearn how to invert seventh chords.\nDIATONIC CHORDS\nDiatonic Triads\nLearn how a scale's notes form special triads.\nRoman Numeral Analysis: Triads\nLearn how diatonic triads are identified.\nDiatonic Seventh Chords\nLearn about the diatonic seventh chords of major and minor scales.\nRoman Numeral Analysis: Seventh Chords\nLearn how seventh chords are identified in Roman numeral analysis.\nComposing with Minor Scales\nLearn how the natural and harmonic minor scales combine.\nVoicing Chords\nLearn how composers arrange the notes of chords.\nAnalysis: O Canada\nWatch an analysis of O Canada.\nCHORD PROGRESSIONS\nNonharmonic Tones\nLearn about the different types of nonharmonic tones.\nPhrases and Cadences\nLearn about musical phrases and the different types of cadences.\nCircle Progressions\nLearn about root motion and circular chord progressions.\nCommon Chord Progressions\nLearn how chord progressions tend to follow a common pattern.\nTriads in First Inversion\nLearn how first inversion triads are commonly used\nin chord progressions\n.\nTriads in Second Inversion\nLearn how second inversion triads are commonly used\nin chord progressions\n.\nAnalysis: Auld Lang Syne\nWatch an analysis of Auld Lang Syne.\nNEAPOLITAN CHORDS\nBuilding Neapolitan Chords\nLearn how to build a Neapolitan chord.\nUsing Neapolitan Chords\nLearn how a Neapolitan chord in first inversion is commonly used.\nAnalysis: Moonlight Sonata\nWatch an analysis of Beethoven's Moonlight Sonata\n(measures 49-51)\n.\nFAQ\nLegal\nPrivacy\n© 2000-2025 musictheory.net, LLC\nApple, the Apple logo, iPhone, and iPad are trademarks of Apple Inc.,\nregistered in the U.S. and other countries. App Store is a service mark of Apple Inc."
  },
  {
    "source": "https://www.sweetwater.com/sweetcare/",
    "content": "Access to this page has been denied"
  },
  {
    "source": "https://www.guitartricks.com/",
    "content": "Just a moment...\nEnable JavaScript and cookies to continue"
  },
  {
    "source": "https://en.wikipedia.org/wiki/Music_theory",
    "content": "Music theory - Wikipedia\nJump to content\nMain menu\nMain menu\nmove to sidebar\nhide\nNavigation\nMain page\nContents\nCurrent events\nRandom article\nAbout Wikipedia\nContact us\nContribute\nHelp\nLearn to edit\nCommunity portal\nRecent changes\nUpload file\nSpecial pages\nSearch\nSearch\nAppearance\nDonate\nCreate account\nLog in\nPersonal tools\nDonate\nCreate account\nLog in\nPages for logged out editors\nlearn more\nContributions\nTalk\nContents\nmove to sidebar\nhide\n(Top)\n1\nHistory\nToggle History subsection\n1.1\nAntiquity\n1.1.1\nMesopotamia\n1.1.2\nChina\n1.1.3\nIndia\n1.1.4\nGreece\n1.2\nPost-classical or Medieval Period\n1.2.1\nChina\n1.2.2\nArabic countries / Persian countries\n1.2.3\nEurope\n1.3\nModern\n1.3.1\nMiddle Eastern and Central Asian countries\n1.3.2\nEurope\n1.4\nContemporary\n2\nFundamentals of music\nToggle Fundamentals of music subsection\n2.1\nPitch\n2.2\nScales and modes\n2.3\nConsonance and dissonance\n2.4\nRhythm\n2.5\nMelody\n2.6\nChord\n2.7\nHarmony\n2.8\nTimbre\n2.8.1\nDynamics\n2.8.2\nArticulation\n2.9\nTexture\n2.10\nForm or structure\n2.11\nExpression\n2.12\nNotation\n3\nAs academic discipline\nToggle As academic discipline subsection\n3.1\nAnalysis\n3.2\nMusic perception and cognition\n3.3\nGenre and technique\n3.4\nMathematics\n3.5\nSerial composition and set theory\n3.6\nMusical semiotics\n3.7\nEducation and careers\n4\nSee also\n5\nNotes\n6\nReferences\nToggle References subsection\n6.1\nSources\n7\nFurther reading\n8\nExternal links\nToggle the table of contents\nMusic theory\n54 languages\nAlemannisch\nالعربية\nAsturianu\nAzərbaycanca\nবাংলা\nБългарски\nCatalà\nČeština\nDansk\nDeutsch\nEesti\nEspañol\nEsperanto\nEuskara\nفارسی\nFrançais\n한국어\nहिन्दी\nHrvatski\nBahasa Indonesia\nÍslenska\nItaliano\nעברית\nქართული\nLatina\nMagyar\nМакедонски\nNederlands\n日本語\nNorsk bokmål\nNorsk nynorsk\nOʻzbekcha / ўзбекча\nPolski\nPortuguês\nRomână\nРусский\nScots\nSicilianu\nSimple English\nSlovenčina\nکوردی\nСрпски / srpski\nSrpskohrvatski / српскохрватски\nSuomi\nSvenska\nTagalog\nతెలుగు\nTürkçe\nУкраїнська\nاردو\nTiếng Việt\n粵語\n中文\nРуски\nEdit links\nArticle\nTalk\nEnglish\nRead\nEdit\nView history\nTools\nTools\nmove to sidebar\nhide\nActions\nRead\nEdit\nView history\nGeneral\nWhat links here\nRelated changes\nUpload file\nPermanent link\nPage information\nCite this page\nGet shortened URL\nDownload QR code\nPrint/export\nDownload as PDF\nPrintable version\nIn other projects\nWikimedia Commons\nWikibooks\nWikiquote\nWikiversity\nWikidata item\nAppearance\nmove to sidebar\nhide\nFrom Wikipedia, the free encyclopedia\nStudy of the practices and possibilities of music\nJubal\n,\nPythagoras\nand\nPhilolaus\nengaged in theoretical investigations, in a woodcut from\nFranchinus Gaffurius\n,\nTheorica musicæ\n(1492)\nMusic theory\nis the study of theoretical frameworks for understanding the practices and possibilities of\nmusic\n.\nThe Oxford Companion to Music\ndescribes three interrelated uses of the term \"music theory\": The first is the \"\nrudiments\n\", that are needed to understand\nmusic notation\n(\nkey signatures\n,\ntime signatures\n, and\nrhythmic notation\n); the second is learning scholars' views on music from\nantiquity\nto the present; the third is a sub-topic of\nmusicology\nthat \"seeks to define processes and general principles in music\". The musicological approach to theory differs from music analysis \"in that it takes as its starting-point not the individual work or performance but the fundamental materials from which it is built.\"\n[\n1\n]\nMusic theory is frequently concerned with describing how musicians and composers make music, including\ntuning systems\nand composition methods among other topics. Because of the ever-expanding conception of\nwhat constitutes music\n, a more inclusive definition could be the consideration of any sonic phenomena, including silence. This is not an absolute guideline, however; for example, the study of \"music\" in the\nQuadrivium\nliberal arts university\ncurriculum, that was common in\nmedieval Europe\n, was an abstract system of proportions that was carefully studied at a distance from actual musical practice.\n[\nn 1\n]\nBut this medieval discipline became the basis for tuning systems in later centuries and is generally included in modern scholarship on the history of music theory.\n[\nn 2\n]\nMusic theory as a practical discipline encompasses the methods and concepts that composers and other musicians use in creating and performing music. The development, preservation, and transmission of music theory in this sense may be found in oral and written music-making traditions,\nmusical instruments\n, and other\nartifacts\n. For example, ancient instruments from\nprehistoric\nsites around the world reveal details about the music they produced and potentially something of the musical theory that might have been used by their makers. In ancient and living cultures around the world, the deep and long roots of music theory are visible in instruments, oral traditions, and current music-making. Many cultures have also considered music theory in more formal ways such as written\ntreatises\nand\nmusic notation\n. Practical and scholarly traditions overlap, as many practical treatises about music place themselves within a tradition of other treatises, which are cited regularly just as\nscholarly writing\ncites earlier research.\nIn modern academia, music theory is a subfield of\nmusicology\n, the wider study of musical cultures and history.\nGuido Adler\n, however, in one of the texts that founded musicology in the late 19th century, wrote that \"the science of music originated at the same time as the art of sounds\",\n[\n3\n]\nwhere \"the science of music\" (\nMusikwissenschaft\n) obviously meant \"music theory\". Adler added that music only could exist when one began measuring pitches and comparing them to each other. He concluded that \"all people for which one can speak of an art of sounds also have a science of sounds\".\n[\n4\n]\nOne must deduce that music theory exists in all musical cultures of the world.\nMusic theory is often concerned with abstract musical aspects such as\ntuning\nand tonal systems,\nscales\n,\nconsonance and dissonance\n, and rhythmic relationships. There is also a body of theory concerning practical aspects, such as the creation or the performance of music,\norchestration\n,\nornamentation\n, improvisation, and\nelectronic sound\nproduction.\n[\n5\n]\nA person who researches or teaches music theory is a music theorist. University study, typically to the\nMA\nor\nPhD\nlevel, is required to teach as a tenure-track music theorist in a US or Canadian university. Methods of analysis include mathematics, graphic analysis, and especially analysis enabled by western music notation. Comparative, descriptive, statistical, and other methods are also used. Music theory\ntextbooks\n, especially in the United States of America, often include elements of\nmusical acoustics\n, considerations of\nmusical notation\n, and techniques of tonal\ncomposition\n(\nharmony\nand\ncounterpoint\n), among other topics.\nHistory\n[\nedit\n]\nFurther information:\nHistory of music\nAntiquity\n[\nedit\n]\nFurther information:\nAncient music\nMesopotamia\n[\nedit\n]\nSee also:\nMusic of Mesopotamia\nSeveral surviving\nSumerian\nand\nAkkadian\nclay tablets\ninclude musical information of a theoretical nature, mainly lists of\nintervals\nand\ntunings\n.\n[\n6\n]\nThe scholar Sam Mirelman reports that the earliest of these texts dates from before 1500 BCE, a millennium earlier than surviving evidence from any other culture of comparable musical thought. Further, \"All the Mesopotamian texts [about music] are united by the use of a terminology for music that, according to the approximate dating of the texts, was in use for over 1,000 years.\"\n[\n7\n]\nChina\n[\nedit\n]\nSee also:\nMusic of China\nand\nChinese musicology\nMuch of Chinese music history and theory remains unclear.\n[\n8\n]\nChinese theory starts from numbers, the main musical numbers being twelve, five and eight. Twelve refers to the number of pitches on which the scales can be constructed, Five refers to the Pentatonic Scale (primarily uses a 5-note scale), And Eight refers to the eight categories of Chinese Music Instruments; classified by the material they are made from: (Metal, Stone, Silk, Bamboo, Gourd, Clay, Leather, and Wood). The\nLüshi chunqiu\nfrom about 238 BCE recalls the legend of\nLing Lun\n. On order of the\nYellow Emperor\n, Ling Lun collected twelve\nbamboo\nlengths with thick and even nodes. Blowing on one of these like a pipe, he found its sound agreeable and named it\nhuangzhong\n, the \"Yellow Bell.\" He then heard\nphoenixes\nsinging. The male and female phoenix each sang six tones. Ling Lun cut his bamboo pipes to match the pitches of the phoenixes, producing twelve pitch pipes in two sets: six from the male phoenix and six from the female: these were called the\nlülü\nor later the\nshierlü\n.\n[\n9\n]\nApart from technical and structural aspects, ancient Chinese music theory also discusses topics such as the nature and functions of music. The\nYueji\n(\"Record of music\", c1st and 2nd centuries BCE), for example, manifests\nConfucian\nmoral theories of understanding music in its social context. Studied and implemented by Confucian scholar-officials [...], these theories helped form a musical Confucianism that overshadowed but did not erase rival approaches. These include the assertion of\nMozi\n(c. 468 – c. 376 BCE) that music wasted human and material resources, and\nLaozi\n's claim that the greatest music had no sounds. [...] Even the music of the\nqin\nzither\n, a genre closely affiliated with Confucian scholar-officials, includes many works with\nDaoist\nreferences, such as\nTianfeng huanpei\n(\"Heavenly Breeze and Sounds of Jade Pendants\").\n[\n8\n]\nIndia\n[\nedit\n]\nSee also:\nMusic of India\nThe\nSamaveda\nand\nYajurveda\n(c. 1200 – 1000 BCE) are among the earliest testimonies of Indian music, but properly speaking, they contain no theory. The\nNatya Shastra\n, written between 200 BCE to 200 CE, discusses intervals (\nŚrutis\n), scales (\nGrāmas\n), consonances and dissonances, classes of melodic structure (\nMūrchanās\n, modes?), melodic types (\nJātis\n), instruments, etc.\n[\n10\n]\nGreece\n[\nedit\n]\nSee also:\nMusical system of ancient Greece\nand\nList of music theorists § Antiquity\nEarly preserved Greek writings on music theory include two types of works:\n[\n11\n]\ntechnical manuals describing the Greek musical system including notation, scales, consonance and dissonance, rhythm, and types of musical compositions;\ntreatises on the way in which music reveals universal patterns of order leading to the highest levels of knowledge and understanding.\nSeveral names of theorists are known before these works, including\nPythagoras\n(\nc.\n570\n~\nc.\n495\nBCE\n),\nPhilolaus\n(\nc.\n470 ~ (\nc.\n385\nBCE\n),\nArchytas\n(428–347\nBCE\n), and others.\nWorks of the first type (technical manuals) include\nAnonymous (erroneously attributed to\nEuclid\n) (1989) [4th–\n3rd century\nBCE\n]. Barker, Andrew (ed.).\nΚατατομή κανόνος\n[\nDivision of the Canon\n]. Greek Musical Writings. Vol. 2: Harmonic and Acoustic Theory. Cambridge, UK: Cambridge University Press. pp.\n191–\n208. English trans.\nTheon of Smyrna\n.\nΤωv κατά τό μαθηματικόν χρησίμων είς τήν Πλάτωνος άνάγνωσις\n[\nOn the Mathematics Useful for Understanding Plato\n] (in Greek). 115–140\nCE\n.\nNicomachus of Gerasa\n.\nΆρμονικόν έγχειρίδιον\n[\nManual of Harmonics\n]. 100–150\nCE\n.\nCleonides\n.\nΕίσαγωγή άρμονική\n[\nIntroduction to Harmonics\n] (in Greek).\n2nd century\nCE\n.\nGaudentius\n.\nΆρμονική είσαγωγή\n[\nHarmonic Introduction\n] (in Greek). 3rd or\n4th century\nCE\n.\nBacchius Geron.\nΕίσαγωγή τέχνης μουσικής\n[\nIntroduction to the Art of Music\n].\n4th century\nCE\nor later.\nAlypius of Alexandria\n.\nΕίσαγωγή μουσική\n[\nIntroduction to Music\n] (in Greek). 4th–\n5th century\nCE\n.\nMore philosophical treatises of the second type include\nAristoxenus\n.\nΆρμονικά στοιχεία\n[\nHarmonic Elements\n] (in Greek). 375~360\nBCE\n, before 320\nBCE\n.\nAristoxenus\n.\nΡυθμικά στοιχεία\n[\nRhythmic Elements\n] (in Greek).\nPtolemaios (\nΠτολεμαίος\n), Claudius\n.\nΆρμονικά\n[\nHarmonics\n] (in Greek). 127–148\nCE\n.\nPorphyrius\n.\nΕίς τά άρμονικά Πτολεμαίον ύπόμνημα\n[\nOn Ptolemy's Harmonics\n] (in Greek).\nc.\n232~233\n–\nc.\n305\nCE\n.\nPost-classical or Medieval Period\n[\nedit\n]\nSee also:\nList of music theorists § Post-classical\n, and\nList of medieval music theorists\nChina\n[\nedit\n]\nThe\npipa\ninstrument carried with it a theory of musical modes that subsequently led to the Sui and Tang theory of 84 musical modes.\n[\n8\n]\nArabic countries / Persian countries\n[\nedit\n]\nMedieval Arabic music theorists include:\n[\nn 3\n]\nAbū Yūsuf Ya'qūb\nal-Kindi\n(Bagdad, 873 CE), who uses the first twelve letters of the alphabet to describe the twelve frets on five strings of the\noud\n, producing a chromatic scale of 25 degrees.\n[\n12\n]\n[Yaḥyā ibn] al-\nMunajjim\n(Baghdad, 856–912), author of\nRisāla fī al-mūsīqī\n(\"Treatise on music\", MS GB-Lbl Oriental 2361) which describes a\nPythagorean tuning\nof the\noud\nand a system of eight modes perhaps inspired by\nIshaq al-Mawsili\n(767–850).\n[\n13\n]\nAbū n-Nașr Muḥammad\nal-Fārābi\n(Persia, 872? – Damas, 950 or 951 CE), author of\nKitab al-Musiqa al-Kabir\n(\"The Great Book of Music\").\n[\n14\n]\n'Ali ibn al-Husayn ul-Isfahānī (897–967), known as\nAbu al-Faraj al-Isfahani\n, author of\nKitāb al-Aghānī\n(\"The Book of Songs\").\nAbū 'Alī al-Ḥusayn ibn ʿAbd-Allāh ibn Sīnā, known as\nAvicenna\n(c. 980 – 1037), whose contribution to music theory consists mainly in Chapter 12 of the section on mathematics of his\nKitab Al-Shifa\n(\"\nThe Book of Healing\n\").\n[\n15\n]\nal-Ḥasan ibn Aḥmad ibn 'Ali al-Kātib, author of Kamāl adab al Ghinā' (\"The Perfection of Musical Knowledge\"), copied in 1225 (Istanbul, Topkapi Museum, Ms 1727).\n[\n16\n]\nSafi al-Din al-Urmawi\n(1216–1294 CE), author of the\nKitabu al-Adwār\n(\"Treatise of musical cycles\") and\nar-Risālah aš-Šarafiyyah\n(\"Epistle to Šaraf\").\n[\n17\n]\nMubārak Šāh, commentator of Safi al-Din's\nKitāb al-Adwār\n(\nBritish Museum\n, Ms 823).\n[\n18\n]\nAnon. LXI, Anonymous commentary on Safi al-Din's\nKitāb al-Adwār\n.\n[\n19\n]\nShams al-dῑn al-Saydᾱwῑ Al-Dhahabῑ (14th century CE (?)), music theorist. Author of\nUrjῡza fi'l-mῡsῑqᾱ\n(\"A Didactic Poem on Music\").\n[\n20\n]\nEurope\n[\nedit\n]\nThe Latin treatise\nDe institutione musica\nby the Roman philosopher\nBoethius\n(written c. 500, translated as\nFundamentals of Music\n[\n2\n]\n) was a touchstone for other writings on music in medieval Europe. Boethius represented Classical authority on music during the Middle Ages, as the Greek writings on which he based his work were not read or translated by later Europeans until the 15th century.\n[\n21\n]\nThis treatise carefully maintains distance from the actual practice of music, focusing mostly on the mathematical proportions involved in tuning systems and on the moral character of particular modes. Several centuries later, treatises began to appear which dealt with the actual composition of pieces of music in the\nplainchant\ntradition.\n[\n22\n]\nAt the end of the ninth century,\nHucbald\nworked towards more precise pitch notation for the\nneumes\nused to record plainchant.\nGuido d'Arezzo\nwrote a letter to Michael of Pomposa in 1028, entitled\nEpistola de ignoto cantu\n,\n[\n23\n]\nin which he introduced the practice of using syllables to describe notes and intervals. This was the source of the hexachordal\nsolmization\nthat was to be used until the end of the Middle Ages. Guido also wrote about emotional qualities of the modes, the phrase structure of plainchant, the temporal meaning of the neumes, etc.; his chapters on polyphony \"come closer to describing and illustrating real music than any previous account\" in the Western tradition.\n[\n21\n]\nDuring the thirteenth century, a new rhythm system called\nmensural notation\ngrew out of an earlier, more limited method of notating rhythms in terms of fixed repetitive patterns, the so-called rhythmic modes, which were developed in France around 1200. An early form of mensural notation was first described and codified in the treatise\nArs cantus mensurabilis\n(\"The art of measured chant\") by\nFranco of Cologne\n(c. 1280). Mensural notation used different note shapes to specify different durations, allowing scribes to capture rhythms which varied instead of repeating the same fixed pattern; it is a proportional notation, in the sense that each note value is equal to two or three times the shorter value, or half or a third of the longer value. This same notation, transformed through various extensions and improvements during the Renaissance, forms the basis for rhythmic notation in\nEuropean classical music\ntoday.\nModern\n[\nedit\n]\nMiddle Eastern and Central Asian countries\n[\nedit\n]\nBāqiyā Nāyinῑ (Uzbekistan, 17th century CE), Uzbek author and music theorist. Author of\nZamzama e wahdat-i-mῡsῑqῑ\n[\"The Chanting of Unity in Music\"].\n[\n20\n]\nBaron Francois Rodolphe d'Erlanger (Tunis, Tunisia, 1910–1932 CE), French musicologist. Author of\nLa musique arabe\nand\nTa'rῑkh al-mῡsῑqᾱ al-arabiyya wa-usῡluha wa-tatawwurᾱtuha\n[\"A History of Arabian Music, its principles and its Development\"]\nD'Erlanger divulges that the Arabic music scale is derived from the Greek music scale, and that Arabic music is connected to certain features of Arabic culture, such as astrology.\n[\n20\n]\nEurope\n[\nedit\n]\nRenaissance\nFurther information:\nList of music theorists § 15th and 16th centuries\nBaroque\nFurther information:\nList of music theorists § 17th century\nFurther information:\nList of music theorists § 18th century\n1750–1900\nAs Western musical influence spread throughout the world in the 1800s, musicians adopted Western theory as an international standard—but other theoretical traditions in both textual and oral traditions remain in use. For example, the long and rich musical traditions unique to ancient and current cultures of Africa are primarily oral, but describe specific forms, genres, performance practices, tunings, and other aspects of music theory.\n[\n24\n]\n[\n25\n]\nSacred harp\nmusic uses a different kind of scale and theory in practice. The music focuses on the solfege \"fa, sol, la\" on the music scale. Sacred Harp also employs a different notation involving \"shape notes\", or notes that are shaped to correspond to a certain solfege syllable on the music scale. Sacred Harp music and its music theory originated with Reverend Thomas Symmes in 1720, where he developed a system for \"singing by note\" to help his church members with note accuracy.\n[\n26\n]\nFurther information:\nList of music theorists § 19th century\nContemporary\n[\nedit\n]\nSee also:\nList of music theorists § 20th century\n, and\nList of music theorists § 21st century\nFundamentals of music\n[\nedit\n]\nMain article:\nAspect of music\nMusic is composed of\naural\nphenomena; \"music theory\" considers how those phenomena apply in music. Music theory considers melody, rhythm, counterpoint, harmony, form, tonal systems, scales, tuning, intervals, consonance, dissonance, durational proportions, the acoustics of pitch systems, composition, performance, orchestration, ornamentation, improvisation, electronic sound production, etc.\n[\n27\n]\nPitch\n[\nedit\n]\nMain article:\nPitch (music)\nMiddle C (261.626 Hz)\nPitch is the lowness or highness of a\ntone\n, for example the difference between\nmiddle C\nand a higher C. The frequency of the sound waves producing a pitch can be measured precisely, but the perception of pitch is more complex because single notes from natural sources are usually a complex mix of many frequencies. Accordingly, theorists often describe pitch as a subjective sensation rather than an objective measurement of sound.\n[\n28\n]\nSpecific frequencies are often assigned letter names. Today most orchestras assign\nconcert A\n(the A above\nmiddle C\non the piano) to the frequency of 440 Hz. This assignment is somewhat arbitrary; for example, in 1859 France, the same A was tuned to 435 Hz. Such differences can have a noticeable effect on the timbre of instruments and other phenomena. Thus, in\nhistorically informed performance\nof older music, tuning is often set to match the tuning used in the period when it was written. Additionally, many cultures do not attempt to standardize pitch, often considering that it should be allowed to vary depending on genre, style, mood, etc.\nThe difference in pitch between two notes is called an\ninterval\n. The most basic interval is the\nunison\n, which is simply two notes of the same pitch. The\noctave\ninterval is two pitches that are either double or half the frequency of one another. The unique characteristics of octaves gave rise to the concept of\npitch class\n: pitches of the same letter name that occur in different octaves may be grouped into a single \"class\" by ignoring the difference in octave. For example, a high C and a low C are members of the same pitch class—the class that contains all C's.\n[\n29\n]\nMusical tuning\nsystems, or temperaments, determine the precise size of intervals. Tuning systems vary widely within and between world cultures. In\nWestern culture\n, there have long been several competing tuning systems, all with different qualities. Internationally, the system known as\nequal temperament\nis most commonly used today because it is considered the most satisfactory compromise that allows instruments of fixed tuning (e.g. the piano) to sound acceptably in tune in all keys.\nScales and modes\n[\nedit\n]\nMain articles:\nMusical scale\nand\nMusical mode\nA pattern of whole and half steps in the Ionian mode or major scale on C\nNotes can be arranged in a variety of\nscales\nand\nmodes\n. Western music theory generally divides the octave into a series of twelve pitches, called a\nchromatic scale\n, within which the interval between adjacent tones is called a\nsemitone\n, or half step. Selecting tones from this set of 12 and arranging them in patterns of semitones and whole tones creates other scales.\n[\n30\n]\nThe most commonly encountered scales are the seven-toned\nmajor\n, the\nharmonic minor\n, the\nmelodic minor\n, and the\nnatural minor\n. Other examples of scales are the\noctatonic scale\nand the\npentatonic\nor five-tone scale, which is common in\nfolk music\nand\nblues\n. Non-Western cultures often use scales that do not correspond with an equally divided twelve-tone division of the octave. For example, classical\nOttoman\n,\nPersian\n,\nIndian\nand\nArabic\nmusical systems often make use of multiples of quarter tones (half the size of a semitone, as the name indicates), for instance in 'neutral' seconds (three quarter tones) or 'neutral' thirds (seven quarter tones)—they do not normally use the quarter tone itself as a direct interval.\n[\n30\n]\nIn traditional Western notation, the scale used for a composition is usually indicated by a\nkey signature\nat the beginning to designate the pitches that make up that scale. As the music progresses, the pitches used may change and introduce a different scale. Music can be\ntransposed\nfrom one scale to another for various purposes, often to accommodate the range of a vocalist. Such transposition raises or lowers the overall pitch range, but preserves the intervallic relationships of the original scale. For example, transposition from the key of C major to D major raises all pitches of the scale of C major equally by a\nwhole tone\n. Since the interval relationships remain unchanged, transposition may be unnoticed by a listener, however other qualities may change noticeably because transposition changes the relationship of the overall pitch\nrange\ncompared to the range of the instruments or voices that perform the music. This often affects the music's overall sound, as well as having technical implications for the performers.\n[\n31\n]\nThe interrelationship of the keys most commonly used in Western tonal music is conveniently shown by the\ncircle of fifths\n. Unique key signatures are also sometimes devised for a particular composition. During the Baroque period, emotional associations with specific keys, known as the\ndoctrine of the affections\n, were an important topic in music theory, but the unique tonal colorings of keys that gave rise to that doctrine were largely erased with the adoption of equal temperament. However, many musicians continue to feel that certain keys are more appropriate to certain emotions than others.\nIndian classical music\ntheory continues to strongly associate keys with emotional states, times of day, and other extra-musical concepts and notably, does not employ equal temperament.\nConsonance and dissonance\n[\nedit\n]\nMain article:\nConsonance and dissonance\nPerfect octave\n, a consonant interval\nMinor second\n, a dissonant interval\nConsonance and dissonance\nare subjective qualities of the sonority of intervals that vary widely in different cultures and over the ages. Consonance (or concord) is the quality of an interval or chord that seems stable and complete in itself. Dissonance (or discord) is the opposite in that it feels incomplete and \"wants to\" resolve to a consonant interval. Dissonant intervals seem to clash. Consonant intervals seem to sound comfortable together. Commonly, perfect fourths, fifths, and octaves and all major and minor thirds and sixths are considered consonant. All others are dissonant to a greater or lesser degree.\n[\n32\n]\nContext and many other aspects can affect apparent dissonance and consonance. For example, in a Debussy prelude, a major second may sound stable and consonant, while the same interval may sound dissonant in a Bach fugue. In the\nCommon practice era\n, the perfect fourth is considered dissonant when not supported by a lower third or fifth. Since the early 20th century,\nArnold Schoenberg\n's concept of \"emancipated\" dissonance, in which traditionally dissonant intervals can be treated as \"higher,\" more remote consonances, has become more widely accepted.\n[\n32\n]\nRhythm\n[\nedit\n]\nMain article:\nRhythm\nMetric levels\n: beat level shown in middle with division levels above and multiple levels below\nRhythm is produced by the sequential arrangement of sounds and silences in time.\nMeter\nmeasures music in regular pulse groupings, called\nmeasures or bars\n. The\ntime signature\nor meter signature specifies how many beats are in a measure, and which value of written note is counted or felt as a single beat.\nThrough increased stress, or variations in duration or articulation, particular tones may be accented. There are conventions in most musical traditions for regular and hierarchical accentuation of beats to reinforce a given meter.\nSyncopated\nrhythms contradict those conventions by accenting unexpected parts of the beat.\n[\n33\n]\nPlaying simultaneous rhythms in more than one time signature is called\npolyrhythm\n.\n[\n34\n]\nIn recent years, rhythm and meter have become an important area of research among music scholars. The most highly cited of these recent scholars are\nMaury Yeston\n,\n[\n35\n]\nFred Lerdahl\nand\nRay Jackendoff\n,\n[\n36\n]\nJonathan Kramer\n,\n[\n37\n]\nand Justin London.\n[\n38\n]\nMelody\n[\nedit\n]\nMain article:\nMelody\n\"\nPop Goes the Weasel\n\" melody\n[\n39\n]\nA\nmelody\nis a group of musical sounds in agreeable succession or arrangement.\n[\n40\n]\nBecause melody is such a prominent aspect in so much music, its construction and other qualities are a primary interest of music theory.\nThe basic elements of melody are pitch, duration, rhythm, and tempo. The tones of a melody are usually drawn from pitch systems such as\nscales\nor\nmodes\n. Melody may consist, to increasing degree, of the figure, motive, semi-phrase, antecedent and consequent phrase, and period or sentence. The period may be considered the complete melody, however some examples combine two periods, or use other combinations of constituents to create larger form melodies.\n[\n41\n]\nChord\n[\nedit\n]\nMain article:\nChord (music)\nC major triad represented in\nstaff notation\n.\nPlay\nⓘ\nin\njust intonation\nPlay\nⓘ\nin\nEqual temperament\nPlay\nⓘ\nin\n1/4-comma meantone\nPlay\nⓘ\nin\nYoung temperament\nPlay\nⓘ\nin\nPythagorean tuning\nA chord, in music, is any\nharmonic\nset of three or more\nnotes\nthat is heard as if sounding\nsimultaneously\n.\n[\n42\n]\n:\npp. 67, 359\n[\n43\n]\n:\np. 63\nThese need not actually be played together:\narpeggios\nand broken chords may, for many practical and theoretical purposes, constitute chords. Chords and\nsequences of chords\nare frequently used in modern Western, West African,\n[\n44\n]\nand Oceanian\n[\n45\n]\nmusic, whereas they are absent from the music of many other parts of the world.\n[\n46\n]\n:\np. 15\nThe most frequently encountered chords are\ntriads\n, so called because they consist of three distinct notes: further notes may be added to give\nseventh chords\n,\nextended chords\n, or\nadded tone chords\n. The most\ncommon chords\nare the\nmajor\nand\nminor\ntriads\nand then the\naugmented\nand\ndiminished\ntriads\n. The descriptions\nmajor\n,\nminor\n,\naugmented\n, and\ndiminished\nare sometimes referred to collectively as chordal\nquality\n. Chords are also commonly classed by their\nroot\nnote—so, for instance, the chord\nC\nmajor may be described as a triad of major quality built on the note\nC\n. Chords may also be classified by\ninversion\n, the order in which the notes are stacked.\nA series of chords is called a\nchord progression\n. Although any chord may in principle be followed by any other chord, certain patterns of chords have been accepted as establishing\nkey\nin\ncommon-practice harmony\n. To describe this, chords are numbered, using\nRoman numerals\n(upward from the key-note),\n[\n47\n]\nper their\ndiatonic function\n. Common ways of\nnotating or representing chords\n[\n48\n]\nin western music other than conventional\nstaff notation\ninclude\nRoman numerals\n,\nfigured bass\n(much used in the\nBaroque era\n),\nchord letters\n(sometimes used in modern\nmusicology\n), and various systems of\nchord charts\ntypically found in the\nlead sheets\nused in\npopular music\nto lay out the sequence of chords so that the musician may play accompaniment chords or improvise a solo.\nHarmony\n[\nedit\n]\nMain article:\nHarmony\nBarbershop quartets\n, such as this US Navy group, sing 4-part pieces, made up of a melody line (normally the second-highest voice, called the \"lead\") and 3 harmony parts.\nIn music, harmony is the use of simultaneous\npitches\n(\ntones\n,\nnotes\n), or\nchords\n.\n[\n46\n]\n:\np. 15\nThe study of harmony involves chords and their construction and\nchord progressions\nand the principles of connection that govern them.\n[\n49\n]\nHarmony is often said to refer to the \"vertical\" aspect of music, as distinguished from\nmelodic line\n, or the \"horizontal\" aspect.\n[\n50\n]\nCounterpoint\n, which refers to the interweaving of melodic lines, and\npolyphony\n, which refers to the relationship of separate independent voices, is thus sometimes distinguished from harmony.\n[\n51\n]\nIn\npopular\nand\njazz harmony\n, chords are named by their\nroot\nplus various terms and characters indicating their qualities. For example, a\nlead sheet\nmay indicate chords such as C major, D minor, and G dominant seventh. In many types of music, notably Baroque, Romantic, modern, and jazz, chords are often augmented with \"tensions\". A tension is an additional chord member that creates a relatively\ndissonant interval\nin relation to the bass. It is part of a chord, but is not one of the chord tones (1 3 5 7). Typically, in the classical\ncommon practice period\na dissonant chord (chord with tension) \"resolves\" to a consonant chord.\nHarmonization\nusually sounds pleasant to the ear when there is a balance between the consonant and dissonant sounds. In simple words, that occurs when there is a balance between \"tense\" and \"relaxed\" moments.\n[\n52\n]\n[\nunreliable source?\n]\nTimbre\n[\nedit\n]\nMain article:\nTimbre\nSpectrogram\nof the first second of an E9 chord played on a Fender Stratocaster guitar with noiseless pickups. Below is the E9 chord audio:\nTimbre, sometimes called \"color\", or \"tone color,\" is the principal phenomenon that allows us to distinguish one instrument from another when both play at the same pitch and volume, a quality of a voice or instrument often described in terms like bright, dull, shrill, etc. It is of considerable interest in music theory, especially because it is one component of music that has as yet, no standardized nomenclature. It has been called \"... the psychoacoustician's multidimensional waste-basket category for everything that cannot be labeled pitch or loudness,\"\n[\n53\n]\nbut can be accurately described and analyzed by\nFourier analysis\nand other methods\n[\n54\n]\nbecause it results from the combination of all sound\nfrequencies\n, attack and release envelopes, and other qualities that a tone comprises.\nTimbre\nis principally determined by two things: (1) the relative balance of\novertones\nproduced by a given instrument due its construction (e.g. shape, material), and (2) the\nenvelope\nof the sound (including changes in the overtone structure over time). Timbre varies widely between different instruments, voices, and to lesser degree, between instruments of the same type due to variations in their construction, and significantly, the performer's technique. The timbre of most instruments can be changed by employing different techniques while playing. For example, the timbre of a trumpet changes when a mute is inserted into the bell, the player changes their embouchure, or volume.\n[\ncitation needed\n]\nA voice can change its timbre by the way the performer manipulates their vocal apparatus, (e.g. the shape of the vocal cavity or mouth). Musical notation frequently specifies alteration in timbre by changes in sounding technique, volume, accent, and other means. These are indicated variously by symbolic and verbal instruction. For example, the word\ndolce\n(sweetly) indicates a non-specific, but commonly understood soft and \"sweet\" timbre.\nSul tasto\ninstructs a string player to bow near or over the fingerboard to produce a less brilliant sound.\nCuivre\ninstructs a brass player to produce a forced and stridently brassy sound. Accent symbols like\nmarcato\n(^) and dynamic indications (\npp\n) can also indicate changes in timbre.\n[\n55\n]\nDynamics\n[\nedit\n]\nThis section\ndoes not\ncite\nany\nsources\n.\nPlease help\nimprove this section\nby\nadding citations to reliable sources\n. Unsourced material may be challenged and\nremoved\n.\n(\nJuly 2015\n)\n(\nLearn how and when to remove this message\n)\nMain article:\nDynamics (music)\nIllustration of hairpins in musical notation\nIn music, \"\ndynamics\n\" normally refers to variations of intensity or volume, as may be measured by physicists and audio engineers in\ndecibels\nor\nphons\n. In music notation, however, dynamics are not treated as absolute values, but as relative ones. Because they are usually measured subjectively, there are factors besides amplitude that affect the performance or perception of intensity, such as timbre, vibrato, and articulation.\nThe conventional indications of dynamics are abbreviations for Italian words like\nforte\n(\nf\n) for loud and\npiano\n(\np\n) for soft. These two basic notations are modified by indications including\nmezzo piano\n(\nmp\n) for moderately soft (literally \"half soft\") and\nmezzo forte\n(\nmf\n) for moderately loud,\nsforzando\nor\nsforzato\n(\nsfz\n) for a surging or \"pushed\" attack, or\nfortepiano\n(\nfp\n) for a loud attack with a sudden decrease to a soft level. The full span of these markings usually range from a nearly inaudible\npianissississimo\n(\npppp\n) to a loud-as-possible\nfortissississimo\n(\nffff\n).\nGreater extremes of\npppppp\nand\nfffff\nand nuances such as\np+\nor\npiù piano\nare sometimes found. Other systems of indicating volume are also used in both notation and analysis: dB (decibels), numerical scales, colored or different sized notes, words in languages other than Italian, and symbols such as those for progressively increasing volume (\ncrescendo\n) or decreasing volume (\ndiminuendo\nor\ndecrescendo\n), often called \"\nhairpins\n\" when indicated with diverging or converging lines as shown in the graphic above.\nArticulation\n[\nedit\n]\nThis section\ndoes not\ncite\nany\nsources\n.\nPlease help\nimprove this section\nby\nadding citations to reliable sources\n. Unsourced material may be challenged and\nremoved\n.\n(\nJuly 2015\n)\n(\nLearn how and when to remove this message\n)\nMain article:\nArticulation (music)\nExamples of articulation marks. From left to right:\nstaccato\n,\nstaccatissimo\n,\nmartellato\n,\naccent\n,\ntenuto\n.\nArticulation is the way the performer sounds notes. For example,\nstaccato\nis the shortening of duration compared to the written note value,\nlegato\nperforms the notes in a smoothly joined sequence with no separation. Articulation is often described rather than quantified, therefore there is room to interpret how to execute precisely each articulation.\nFor example,\nstaccato\nis often referred to as \"separated\" or \"detached\" rather than having a defined or numbered amount by which to reduce the notated duration. Violin players use a variety of techniques to perform different qualities of\nstaccato.\nThe manner in which a performer decides to execute a given articulation is usually based on the context of the piece or phrase, but many articulation symbols and verbal instructions depend on the instrument and musical period (e.g. viol, wind; classical, baroque; etc.).\nThere is a set of articulations that most instruments and voices perform in common. They are—from long to short:\nlegato\n(smooth, connected);\ntenuto\n(pressed or played to full notated duration);\nmarcato\n(accented and detached);\nstaccato\n(\"separated\", \"detached\");\nmartelé\n(heavily accented or \"hammered\").\n[\ncontradictory\n]\nMany of these can be combined to create certain \"in-between\" articulations. For example,\nportato\nis the combination of\ntenuto\nand\nstaccato\n. Some instruments have unique methods by which to produce sounds, such as\nspiccato\nfor bowed strings, where the bow bounces off the string.\nTexture\n[\nedit\n]\nMain article:\nMusical texture\nIntroduction to\nSousa\n's \"\nWashington Post March\n,\" mm. 1–7 features\noctave doubling\n[\n56\n]\nand a homorhythmic texture\nIn music, texture is how the\nmelodic\n,\nrhythmic\n, and\nharmonic\nmaterials are combined in a\ncomposition\n, thus determining the overall quality of the sound in a piece. Texture is often described in regard to the density, or thickness, and\nrange\n, or width, between lowest and highest pitches, in relative terms as well as more specifically distinguished according to the number of voices, or parts, and the relationship between these voices. For example, a thick texture contains many \"layers\" of instruments. One of these layers could be a string section, or another brass.\nThe thickness also is affected by the number and the richness of the instruments playing the piece. The thickness varies from light to thick. A lightly textured piece will have light, sparse scoring. A thickly or heavily textured piece will be scored for many instruments. A piece's texture may be affected by the number and character of parts playing at once, the\ntimbre\nof the instruments or voices playing these parts and the harmony,\ntempo\n, and rhythms used.\n[\n57\n]\nThe types categorized by number and relationship of parts are analyzed and determined through the labeling of primary textural elements: primary melody, secondary melody, parallel supporting melody, static support, harmonic support, rhythmic support, and harmonic and rhythmic support.\n[\n58\n]\n[\nincomplete short citation\n]\nCommon types included\nmonophonic\ntexture (a single melodic voice, such as a piece for solo soprano or solo flute), biphonic texture (two melodic voices, such as a duo for bassoon and flute in which the bassoon plays a drone note and the flute plays the melody),\npolyphonic\ntexture and\nhomophonic\ntexture (chords accompanying a melody).\n[\ncitation needed\n]\nForm or structure\n[\nedit\n]\nA musical\ncanon\n.\nEncyclopaedia Britannica\ncalls a \"canon\" both a compositional technique and a musical form.\n[\n59\n]\nMain article:\nMusical form\nThe term musical form (or musical architecture) refers to the overall structure or plan of a piece of music, and it describes the layout of a composition as divided into sections.\n[\n60\n]\nIn the tenth edition of\nThe Oxford Companion to Music\n,\nPercy Scholes\ndefines musical form as \"a series of strategies designed to find a successful mean between the opposite extremes of unrelieved repetition and unrelieved alteration.\"\n[\n61\n]\nAccording to\nRichard Middleton\n, musical form is \"the shape or structure of the work.\" He describes it through difference: the distance moved from a\nrepeat\n; the latter being the smallest difference. Difference is quantitative and qualitative:\nhow far\n, and\nof what type\n, different. In many cases, form depends on statement and\nrestatement\n, unity and variety, and\ncontrast\nand connection.\n[\n62\n]\nExpression\n[\nedit\n]\nMain article:\nMusical expression\nA violinist performing\nMusical expression is the art of playing or singing music with emotional communication. The elements of music that comprise expression include dynamic indications, such as forte or piano,\nphrasing\n, differing qualities of timbre and articulation, color, intensity, energy and excitement. All of these devices can be incorporated by the performer. A performer aims to elicit responses of sympathetic feeling in the audience, and to excite, calm or otherwise sway the audience's physical and emotional responses. Musical expression is sometimes thought to be produced by a combination of other parameters, and sometimes described as a transcendent quality that is more than the sum of measurable quantities such as pitch or duration.\nExpression on instruments can be closely related to the role of the breath in singing, and the voice's natural ability to express feelings, sentiment and deep emotions.\n[\nclarification needed\n]\nWhether these can somehow be categorized is perhaps the realm of academics, who view expression as an element of musical performance that embodies a consistently recognizable\nemotion\n, ideally causing a\nsympathetic emotional response\nin its listeners.\n[\n63\n]\nThe emotional content of musical expression is distinct from the emotional content of specific sounds (e.g., a startlingly-loud 'bang') and of learned associations (e.g., a\nnational anthem\n), but can rarely be completely separated from its context.\n[\ncitation needed\n]\nThe components of musical expression continue to be the subject of extensive and unresolved dispute.\n[\n64\n]\n[\n65\n]\n[\n66\n]\n[\n67\n]\n[\n68\n]\n[\n69\n]\nNotation\n[\nedit\n]\nMain articles:\nMusical notation\nand\nSheet music\nTibetan\nmusical score from the 19th century\nMusical notation is the written or symbolized representation of music. This is most often achieved by the use of commonly understood graphic symbols and written verbal instructions and their abbreviations. There are many systems of music notation from different cultures and different ages. Traditional Western notation evolved during the Middle Ages and remains an area of experimentation and innovation.\n[\n70\n]\nIn the 2000s, computer\nfile formats\nhave become important as well.\n[\n71\n]\nSpoken language and\nhand signs\nare also used to symbolically represent music, primarily in teaching.\nIn standard Western music notation, tones are represented graphically by symbols (notes) placed on a\nstaff\nor staves, the vertical axis corresponding to pitch and the horizontal axis corresponding to time. Note head shapes, stems, flags, ties and dots are used to indicate duration. Additional symbols indicate keys, dynamics, accents, rests, etc. Verbal instructions from the conductor are often used to indicate tempo, technique, and other aspects.\nIn Western music, a range of different music notation systems are used. In Western Classical music, conductors use printed scores that show all of the instruments' parts and orchestra members read parts with their musical lines written out. In popular styles of music, much less of the music may be notated. A rock band may go into a recording session with just a handwritten\nchord chart\nindicating the song's\nchord progression\nusing chord names (e.g., C major, D minor, G7, etc.). All of the chord voicings, rhythms and accompaniment figures are improvised by the band members.\nAs academic discipline\n[\nedit\n]\nThe scholarly study of music theory in the twentieth century has a number of different subfields, each of which takes a different perspective on what are the primary phenomenon of interest and the most useful methods for investigation.\nAnalysis\n[\nedit\n]\nMain articles:\nMusical analysis\n,\nSchenkerian analysis\n, and\nTransformational theory\nTypically a given work is analyzed by more than one person and different or divergent analyses are created. For instance, the first two bars of the prelude to\nClaude Debussy\n's\nPelléas et Melisande\nare analyzed differently by Leibowitz, Laloy, van Appledorn, and Christ. Leibowitz analyses this succession harmonically as D minor:I–VII–V, ignoring melodic motion, Laloy analyses the succession as D:I–V, seeing the G in the second measure as an\nornament\n, and both van Appledorn and Christ analyse the succession as D:I–VII.\nPlay\nⓘ\nMusical analysis is the attempt to answer the question\nhow does this music work?\nThe method employed to answer this question, and indeed exactly what is meant by the question, differs from analyst to analyst, and according to the purpose of the analysis. According to\nIan Bent\n, \"analysis, as a pursuit in its own right, came to be established only in the late 19th century; its emergence as an approach and method can be traced back to the 1750s. However, it existed as a scholarly tool, albeit an auxiliary one, from the\nMiddle Ages\nonwards.\"\n[\n72\n]\n[\nincomplete short citation\n]\nAdolf Bernhard Marx\nwas influential in formalising concepts about composition and music understanding towards the second half of the 19th century. The principle of analysis has been variously criticized, especially by composers, such as\nEdgard Varèse\n's claim that, \"to explain by means of [analysis] is to decompose, to mutilate the spirit of a work\".\n[\n73\n]\nSchenkerian analysis\nis a method of musical analysis of tonal music based on the theories of\nHeinrich Schenker\n(1868–1935). The goal of a Schenkerian analysis is to interpret the underlying structure of a tonal work and to help reading the score according to that structure. The theory's basic tenets can be viewed as a way of defining\ntonality\nin music. A Schenkerian analysis of a passage of music shows hierarchical relationships among its pitches, and draws conclusions about the structure of the passage from this hierarchy. The analysis makes use of a specialized symbolic form of musical notation that Schenker devised to demonstrate various\ntechniques of elaboration\n. The most fundamental concept of Schenker's theory of tonality may be that of\ntonal space\n.\n[\n74\n]\nThe intervals between the notes of the tonic triad form a\ntonal space\nthat is filled with passing and neighbour notes, producing new triads and new tonal spaces, open for further elaborations until the surface of the work (the score) is reached.\nAlthough Schenker himself usually presents his analyses in the generative direction, starting from the\nfundamental structure\n(\nUrsatz\n) to reach the score, the practice of Schenkerian analysis more often is reductive, starting from the score and showing how it can be reduced to its fundamental structure. The graph of the\nUrsatz\nis arrhythmic, as is a strict-counterpoint cantus firmus exercise.\n[\n75\n]\nEven at intermediate levels of the reduction, rhythmic notation (open and closed noteheads, beams and flags) shows not rhythm but the hierarchical relationships between the pitch-events. Schenkerian analysis is\nsubjective\n. There is no mechanical procedure involved and the analysis reflects the musical intuitions of the analyst.\n[\n76\n]\nThe analysis represents a way of hearing (and reading) a piece of music.\nTransformational theory is a branch of music theory developed by\nDavid Lewin\nin the 1980s, and formally introduced in his 1987 work,\nGeneralized Musical Intervals and Transformations\n. The theory, which models\nmusical transformations\nas elements of a\nmathematical group\n, can be used to analyze both\ntonal\nand\natonal music\n. The goal of transformational theory is to change the focus from musical objects—such as the \"C\nmajor chord\n\" or \"G major chord\"—to relations between objects. Thus, instead of saying that a C major chord is followed by G major, a transformational theorist might say that the first chord has been \"transformed\" into the second by the \"\nDominant\noperation.\" (Symbolically, one might write \"Dominant(C major) = G major.\") While traditional\nmusical set theory\nfocuses on the makeup of musical objects, transformational theory focuses on the\nintervals\nor types of musical motion that can occur. According to Lewin's description of this change in emphasis, \"[The transformational] attitude does not ask for some observed measure of extension between reified 'points'; rather it asks: 'If I am\nat\ns and wish to get to t, what characteristic\ngesture\nshould I perform in order to arrive there?'\"\n[\n77\n]\nMusic perception and cognition\n[\nedit\n]\nFurther information:\nMusic psychology\n,\nFred Lerdahl\n, and\nRay Jackendoff\nMusic psychology or the psychology of music may be regarded as a branch of both\npsychology\nand\nmusicology\n. It aims to explain and understand musical\nbehavior\nand\nexperience\n, including the processes through which music is perceived, created, responded to, and incorporated into everyday life.\n[\n78\n]\n[\n79\n]\nModern music psychology is primarily\nempirical\n; its knowledge tends to advance on the basis of interpretations of data collected by systematic\nobservation\nof and interaction with\nhuman participants\n. Music psychology is a field of research with practical relevance for many areas, including music\nperformance\n,\ncomposition\n,\neducation\n,\ncriticism\n, and\ntherapy\n, as well as investigations of human\naptitude\n, skill,\nintelligence\n, creativity, and\nsocial behavior\n.\nMusic psychology can shed light on non-psychological aspects of\nmusicology\nand musical practice. For example, it contributes to music theory through investigations of the\nperception\nand\ncomputational modelling\nof musical structures such as\nmelody\n,\nharmony\n,\ntonality\n,\nrhythm\n,\nmeter\n, and\nform\n. Research in\nmusic history\ncan benefit from systematic study of the history of\nmusical syntax\n, or from psychological analyses of composers and compositions in relation to perceptual, affective, and social responses to their music.\nGenre and technique\n[\nedit\n]\nMain articles:\nMusic genre\nand\nMusical technique\nA Classical\npiano trio\nis a group that plays\nchamber music\n, including\nsonatas\n. The term \"piano trio\" also refers to works composed for such a group.\nA music genre is a conventional category that identifies some pieces of music as belonging to a shared tradition or set of conventions.\n[\n80\n]\nIt is to be distinguished from\nmusical form\nand\nmusical style\n, although in practice these terms are sometimes used interchangeably.\n[\n81\n]\n[\nfailed verification\n]\nMusic can be divided into different\ngenres\nin many different ways. The artistic nature of music means that these classifications are often subjective and controversial, and some genres may overlap. There are even varying academic definitions of the term\ngenre\nitself. In his book\nForm in Tonal Music\n, Douglass M. Green distinguishes between genre and\nform\n. He lists\nmadrigal\n,\nmotet\n,\ncanzona\n,\nricercar\n, and dance as examples of genres from the\nRenaissance\nperiod. To further clarify the meaning of\ngenre\n, Green writes, \"Beethoven's Op. 61 and Mendelssohn's Op. 64 are identical in genre—both are violin concertos—but different in form. However, Mozart's Rondo for Piano, K. 511, and the\nAgnus Dei\nfrom his Mass, K. 317 are quite different in genre but happen to be similar in form.\"\n[\n82\n]\nSome, like\nPeter van der Merwe\n, treat the terms\ngenre\nand\nstyle\nas the same, saying that\ngenre\nshould be defined as pieces of music that came from the same style or \"basic musical language.\"\n[\n83\n]\nOthers, such as Allan F. Moore, state that\ngenre\nand\nstyle\nare two separate terms, and that secondary characteristics such as subject matter can also differentiate between genres.\n[\n84\n]\nA music genre or subgenre may also be defined by the\nmusical techniques\n, the style, the cultural context, and the content and spirit of the themes. Geographical origin is sometimes used to identify a music genre, though a single geographical category will often include a wide variety of subgenres. Timothy Laurie argues that \"since the early 1980s, genre has graduated from being a subset of popular music studies to being an almost ubiquitous framework for constituting and evaluating musical research objects\".\n[\n85\n]\nMusical technique is the ability of\ninstrumental\nand vocal musicians to exert optimal control of their instruments or\nvocal cords\nto produce precise musical effects. Improving technique generally entails practicing exercises that improve muscular sensitivity and agility. To improve technique, musicians often practice fundamental patterns of notes such as the\nnatural\n,\nminor\n,\nmajor\n, and\nchromatic scales\n,\nminor\nand\nmajor triads\n,\ndominant\nand\ndiminished sevenths\n, formula patterns and\narpeggios\n. For example,\ntriads\nand\nsevenths\nteach how to play chords with accuracy and speed.\nScales\nteach how to move quickly and gracefully from one note to another (usually by step). Arpeggios teach how to play\nbroken chords\nover larger intervals. Many of these components of music are found in compositions, for example, a scale is a very common element of classical and romantic era compositions.\n[\ncitation needed\n]\nHeinrich Schenker\nargued that musical technique's \"most striking and distinctive characteristic\" is\nrepetition\n.\n[\n86\n]\nWorks known as\nétudes\n(meaning \"study\") are also frequently used for the improvement of technique.\nMathematics\n[\nedit\n]\nMain article:\nMusic and mathematics\nMusic theorists sometimes use mathematics to understand music, and although music has no\naxiomatic\nfoundation in modern mathematics, mathematics is \"the basis of sound\" and sound itself \"in its musical aspects... exhibits a remarkable array of number properties\", simply because nature itself \"is amazingly mathematical\".\n[\n87\n]\nThe attempt to structure and communicate new ways of composing and hearing music has led to musical applications of\nset theory\n,\nabstract algebra\nand\nnumber theory\n. Some composers have incorporated the\ngolden ratio\nand\nFibonacci numbers\ninto their work.\n[\n88\n]\n[\n89\n]\nThere is a long history of examining the relationships between music and mathematics. Though ancient Chinese, Egyptians and Mesopotamians are known to have studied the mathematical principles of sound,\n[\n90\n]\nthe\nPythagoreans\n(in particular\nPhilolaus\nand\nArchytas\n)\n[\n91\n]\nof ancient Greece were the first researchers known to have investigated the expression of\nmusical scales\nin terms of numerical\nratios\n.\nThe first 16 harmonics, their names and frequencies, showing the exponential nature of the octave and the simple fractional nature of non-octave harmonics\nIn the modern era, musical\nset theory\nuses the language of mathematical set theory in an elementary way to organize musical objects and describe their relationships. To analyze the structure of a piece of (typically atonal) music using musical set theory, one usually starts with a set of tones, which could form motives or chords. By applying simple operations such as\ntransposition\nand\ninversion\n, one can discover deep structures in the music. Operations such as transposition and inversion are called\nisometries\nbecause they preserve the intervals between tones in a set. Expanding on the methods of musical set theory, some theorists have used abstract algebra to analyze music. For example, the pitch classes in an equally tempered octave form an\nabelian group\nwith 12 elements. It is possible to describe\njust intonation\nin terms of a\nfree abelian group\n.\n[\n92\n]\nSerial composition and set theory\n[\nedit\n]\nTone row from\nAlban Berg\n's\nLyric Suite\n, movement I\nFurther information:\nSerialism\n,\nSet theory (music)\n,\nArnold Schoenberg\n,\nMilton Babbitt\n,\nDavid Lewin\n, and\nAllen Forte\nIn music theory, serialism is a method or technique of\ncomposition\nthat uses a series of values to manipulate different\nmusical elements\n. Serialism began primarily with\nArnold Schoenberg\n's\ntwelve-tone technique\n, though his contemporaries were also working to establish serialism as one example of\npost-tonal\nthinking. Twelve-tone technique orders the twelve notes of the\nchromatic scale\n, forming a\nrow\nor series and providing a unifying basis for a composition's\nmelody\n,\nharmony\n, structural progressions, and\nvariations\n. Other types of serialism also work with\nsets\n, collections of objects, but not necessarily with fixed-order series, and extend the technique to other musical dimensions (often called \"\nparameters\n\"), such as\nduration\n,\ndynamics\n, and\ntimbre\n. The idea of serialism is also applied in various ways in the visual arts, design, and architecture\n[\n93\n]\n\"Integral serialism\" or \"total serialism\" is the use of series for aspects such as duration, dynamics, and register as well as pitch.\n[\n94\n]\nOther terms, used especially in Europe to distinguish post-World War II serial music from twelve-tone music and its American extensions, are \"general serialism\" and \"multiple serialism\".\n[\n95\n]\nMusical set theory provides concepts for categorizing musical objects and describing their relationships. Many of the notions were first elaborated by\nHoward Hanson\n(1960) in connection with tonal music, and then mostly developed in connection with atonal music by theorists such as\nAllen Forte\n(1973), drawing on the work in twelve-tone theory of Milton Babbitt. The concepts of set theory are very general and can be applied to tonal and atonal styles in any equally tempered tuning system, and to some extent more generally than that.\n[\ncitation needed\n]\nOne branch of musical set theory deals with collections (sets and permutations) of pitches and pitch classes (pitch-class set theory), which may be ordered or unordered, and can be related by musical operations such as\ntransposition\n,\ninversion\n, and\ncomplementation\n. The methods of musical set theory are sometimes applied to the analysis of rhythm as well.\n[\ncitation needed\n]\nMusical semiotics\n[\nedit\n]\nFurther information:\nMusic semiology\nand\nJean-Jacques Nattiez\nSemiotician\nRoman Jakobson\nMusic semiology (\nsemiotics\n) is the study of signs as they pertain to music on a variety of levels. Following\nRoman Jakobson\n,\nKofi Agawu\nadopts the idea of musical semiosis being introversive or extroversive—that is, musical signs within a text and without.\n[\ncitation needed\n]\n\"Topics\", or various musical conventions (such as horn calls, dance forms, and styles), have been treated suggestively by Agawu, among others.\n[\ncitation needed\n]\nThe notion of\ngesture\nis beginning to play a large role in musico-semiotic enquiry.\n[\ncitation needed\n]\n\"There are strong arguments that music inhabits a semiological realm which, on both\nontogenetic\nand\nphylogenetic\nlevels, has developmental priority over verbal language.\"\n[\n96\n]\n[\n97\n]\n[\n98\n]\n[\n99\n]\n[\n100\n]\n[\n101\n]\n[\n102\n]\n[\n103\n]\n[\nincomplete short citation\n]\n[\nclarification needed\n]\nWriters on music semiology include Kofi Agawu (on topical theory,\n[\ncitation needed\n]\nHeinrich Schenker\n,\n[\n104\n]\n[\n105\n]\nRobert Hatten (on topic, gesture)\n[\ncitation needed\n]\n,\nRaymond Monelle\n(on topic, musical meaning)\n[\ncitation needed\n]\n,\nJean-Jacques Nattiez\n(on introversive taxonomic analysis and ethnomusicological applications)\n[\ncitation needed\n]\n,\nAnthony Newcomb\n(on narrativity)\n[\ncitation needed\n]\n, and\nEero Tarasti\n[\ncitation needed\n]\n.\nRoland Barthes\n, himself a semiotician and skilled amateur pianist, wrote about music in\nImage-Music-Text,\n[\nfull citation needed\n]\nThe Responsibilities of Form,\n[\nfull citation needed\n]\nand\nEiffel Tower,\n[\nfull citation needed\n]\nthough he did not consider music to be a semiotic system\n[\ncitation needed\n]\n.\nSigns, meanings in music, happen essentially through the connotations of sounds, and through the social construction, appropriation and amplification of certain meanings associated with these connotations. The work of\nPhilip Tagg\n(\nTen Little Tunes\n,\n[\nfull citation needed\n]\nFernando the Flute\n,\n[\nfull citation needed\n]\nMusic's Meanings\n[\nfull citation needed\n]\n) provides one of the most complete and systematic analysis of the relation between musical structures and connotations in western and especially popular, television and film music. The work of\nLeonard B. Meyer\nin\nStyle and Music\n[\nfull citation needed\n]\ntheorizes the relationship between ideologies and musical structures and the phenomena of style change, and focuses on romanticism as a case study.\nEducation and careers\n[\nedit\n]\nColumbia University\nmusic theorist\nPat Carpenter\nin an undated photo\nMusic theory in the practical sense has been a part of education at conservatories and music schools for centuries, but the status music theory currently has within academic institutions is relatively recent. In the 1970s, few universities had dedicated music theory programs, many music theorists had been trained as composers or historians, and there was a belief among theorists that the teaching of music theory was inadequate and that the subject was not properly recognised as a scholarly discipline in its own right.\n[\n106\n]\nA growing number of scholars began promoting the idea that music theory should be taught by theorists, rather than composers, performers or music historians.\n[\n106\n]\nThis led to the founding of the\nSociety for Music Theory\nin the United States in 1977. In Europe, the French\nSociété d'Analyse musicale\nwas founded in 1985. It called the First European Conference of Music Analysis for 1989, which resulted in the foundation of the\nSociété belge d'Analyse musicale\nin Belgium and the\nGruppo analisi e teoria musicale\nin Italy the same year, the\nSociety for Music Analysis\nin the UK in 1991, the\nVereniging voor Muziektheorie\nin the Netherlands in 1999 and the\nGesellschaft für Musiktheorie\nin Germany in 2000.\n[\n107\n]\nThey were later followed by the Russian Society for Music Theory in 2013, the Polish Society for Music Analysis in 2015 and the\nSociedad de Análisis y Teoría Musical\nin Spain in 2020, and others are in construction. These societies coordinate the publication of music theory scholarship and support the professional development of music theory researchers. They formed in 2018 a network of European societies for Theory and/or Analysis of Music, the\nEuroT&AM\nAs part of their initial training, music theorists will typically complete a\nB.Mus\nor a\nB.A.\nin music (or a related field) and in many cases an M.A. in music theory. Some individuals apply directly from a bachelor's degree to a PhD, and in these cases, they may not receive an M.A. In the 2010s, given the increasingly interdisciplinary nature of university graduate programs, some applicants for music theory PhD programs may have academic training both in music and outside of music (e.g., a student may apply with a B.Mus. and a Masters in Music Composition or Philosophy of Music).\nMost music theorists work as instructors, lecturers or professors in colleges, universities or\nconservatories\n. The job market for tenure-track professor positions is very competitive: with an average of around 25 tenure-track positions advertised per year in the past decade, 80–100 PhD graduates are produced each year (according to the Survey of Earned Doctorates) who compete not only with each other for those positions but with job seekers that received PhD's in previous years who are still searching for a tenure-track job. Applicants must hold a completed PhD or the equivalent degree (or expect to receive one within a year of being hired—called an \"ABD\", for \"\nAll But Dissertation\n\" stage) and (for more senior positions) have a strong record of publishing in peer-reviewed journals. Some PhD-holding music theorists are only able to find insecure positions as\nsessional lecturers\n. The job tasks of a music theorist are the same as those of a professor in any other humanities discipline: teaching undergraduate and/or graduate classes in this area of specialization and, in many cases some general courses (such as\nMusic appreciation\nor Introduction to Music Theory), conducting research in this area of expertise, publishing research articles in peer-reviewed journals, authoring book chapters, books or textbooks, traveling to conferences to present papers and learn about research in the field, and, if the program includes a graduate school, supervising M.A. and PhD students and giving them guidance on the preparation of their theses and dissertations. Some music theory professors may take on senior administrative positions in their institution, such as\nDean\nor Chair of the School of Music.\nSee also\n[\nedit\n]\nList of music theorists\nMusic psychology\nMusicology\nTheory of painting\nNotes\n[\nedit\n]\n^\nSee Boethius's\nDe institutione musica\n,\n[\n2\n]\nin which he disdains \"musica instrumentalis\" as beneath the \"true\" musician who studies music in the abstract:\nMulto enim est maius atque auctius scire, quod quisque faciat, quam ipsum illud efficere, quod sciat\n(\"It is much better to know what one does than to do what one knows\").\n^\nSee, for example, chapters 4–7 of Christensen, Thomas (2002).\nThe Cambridge History of Western Music Theory\n. Cambridge, UK: Cambridge University Press.\n^\nSee the\nList of music theorists#7th–14th centuries\n, which includes several Arabic theorists; see also\nd'Erlanger 1930–56\n, 1:xv-xxiv.\nReferences\n[\nedit\n]\n^\nFallows, David (2011). \"Theory\".\nThe Oxford Companion to Music\n. Oxford Music Online.\nISBN\n978-0199579037\n.\n^\na\nb\nBoethius 1989\n.\n^\nGuido Adler, \"Umfang, Methode und Ziel der Musikwissenschaft\",\nVierteljahrsschrift für Musikwissenschaft\n1 (1885), p. 5:\nDie Musikwissenschaft entstand gleichzeitig mit der Tonkunst\n.\n^\nIbid.\n^\nPalisca and Bent n.d.\n, Theory, theorists. 1. Definitions.\n^\nMirelman 2010\n;\nMirelman 2013\n;\nWulstan 1968\n;\nKümmel 1970\n;\nKilmer 1971\n;\nKilmer and Mirelman n.d.\n^\nMirelman 2013\n, 43–44.\n^\na\nb\nc\nLam\n^\nService 2013\n.\n^\nThe Nāțyaśāstra, A Treatise on Hindu Dramaturgy and Histrionics, attributed to Bharata Muni\n, translated from the Sanskrit with introduction and notes by Manomohan Ghosh, vol. II, Calcutta, The Asiatic Society, 1961. See particularly pp. 5–19 of the Introduction,\nThe Ancient Indian Theory and Practice of Music\n.\n^\nMathiesen, T.J.\n(2002). \"Greek music theory\". In Christensen, T. (ed.).\nThe Cambridge History of Western Music Theory\n. Cambridge, UK: Cambridge University Press. pp.\n112–\n113.\n^\nManik 1969\n, 24–33.\n^\nWright 2001a\n;\nWright 2001b\n;\nManik 1969\n, 22–24.\n^\nRodolphe d'Erlanger,\nLa Musique arabe\n, vol. I, pp. 1–306; vol. II, pp. 1–101.\n^\nd'Erlanger 1930–56\n, 2:103–245.\n^\nShiloah 1964\n.\n^\nd'Erlanger 1930–56\n, 3:1–182.\n^\nAnon. LXII in Amnon Shiloah,\nThe Theory of Music in Arabic Writings (c. 900–1900): Descriptive Catalogue of Manuscripts in Libraries of Europe and the U.S.A.\n, RISM, München, G. Henle Verlag, 1979. See\nd'Erlanger 1930–56\n, 3:183–566\n^\nGhrab 2009\n.\n^\na\nb\nc\nShiloah, Amnon (2003).\nThe Theory of Music in Arabic Writings (c. 900–1900)\n. Germany: G. Henle Verlag Munchen. pp.\n48, 58, 60–61\n.\nISBN\n978-0-8203-0426-7\n.\n^\na\nb\nPalisca and Bent n.d.\n, §5 Early Middle Ages.\n^\nPalisca and Bent n.d.\n, Theory, theorists §5 Early Middle Ages: \"Boethius could provide a model only for that part of theory which underlies but does not give rules for composition or performance. The first surviving strictly musical treatise of Carolingian times is directed towards musical practice, the Musica disciplina of Aurelian of Réôme (9th century).\"\n^\n\"Guy Aretini's letter to the unknown : modern translation of the letter\"\n.\nHs-augsburg.de\n. Retrieved\n3 March\n2022\n.\n^\nKubik 2010\n, passim.\n^\nEkwueme 1974\n, passim.\n^\nCobb, Buell E. Jr. (1978).\nThe Sacred Harp: A Tradition and Its Music\n. United States of America: The University of Georgia Press Athens. pp.\n4–5, 60–61\n.\nISBN\n978-0-8203-0426-7\n.\n^\nPalisca and Bent n.d\n.\n^\nHartmann 2005\n,\n[\npage needed\n]\n.\n^\nBartlette and Laitz 2010\n,\n[\npage needed\n]\n.\n^\na\nb\nTouma 1996\n,\n[\npage needed\n]\n.\n^\nForsyth 1935\n, 73–74.\n^\na\nb\nLatham 2002\n,\n[\npage needed\n]\n.\n^\n\"Syncopation\".\nThe Oxford Dictionary of Music\n. Oxford University Press. 2013.\nISBN\n978-0199578108\n.\nSyncopation is achieved by accenting a weak instead of a strong beat, by putting rests on strong beats, by holding on over strong beats, and by introducing a sudden change of time‐signature.\n^\n\"Polyrhythm\"\n.\nGrove Music Online\n. Oxford University Press\n. Retrieved\n11 August\n2017\n.\nThe superposition of different rhythms or metres.\n^\nYeston 1976\n.\n^\nLerdahl and Jackendoff 1985\n.\n^\nKramer 1988\n.\n^\nLondon 2004\n.\n^\nKliewer 1975\n,\n[\npage needed\n]\n.\n^\n\"Definition of melody | Dictionary.com\"\n.\nwww.dictionary.com\n. Retrieved\n11 January\n2023\n.\n^\nStein 1979\n, 3–47.\n^\nBenward and Saker 2003\n.\n^\nKárolyi 1965\n.\n^\nMitchell 2008\n.\n^\nLinkels n.d.\n,\n[\npage needed\n]\n.\n^\na\nb\nMalm 1996\n.\n^\nSchoenberg 1983\n, 1–2.\n^\nBenward and Saker 2003\n, 77.\n^\nDahlhaus 2009\n.\n^\nJamini 2005\n, 147.\n^\nFaculty of Arts & Sciences.\n\"Pitch Structure: Harmony and Counterpoint\"\n.\nTheory of Music – Pitch Structure: The Chromatic Scale\n. Harvard University\n. Retrieved\n2 October\n2020\n.\n^\n\"Chapter 2 Elements and concepts of music (With reference to Hindustani and Jazz music)\"\n(PDF)\n.\nShodhganga.inflibnet.ac.in\n. Retrieved\n3 March\n2022\n.\n^\nMcAdams and Bregman 1979\n, 34.\n^\nMannell n.d\n.\n^\n\"How Loud? How Soft?\"\n(PDF)\n.\nSheffield-Sheffield Lake City Schools\n.\n^\nBenward and Saker 2003\n, p. 133.\n^\nBenward and Saker 2003\n,\n[\npage needed\n]\n.\n^\nIsaac and Russell 2003\n, 136.\nsfn error: no target: CITEREFIsaac_and_Russell2003 (\nhelp\n)\n^\nCanon: music\nat the\nEncyclopædia Britannica\n^\nBrandt 2007\n.\n^\nScholes 1977\n.\n^\nMiddleton 1999\n,\n[\npage needed\n]\n.\n^\nLondon n.d\n.\n^\nAvison 1752\n,\n[\npage needed\n]\n.\n^\nChristiani 1885\n,\n[\npage needed\n]\n.\n^\nLussy 1892\n,\n[\npage needed\n]\n.\n^\nDarwin 1913\n,\n[\npage needed\n]\n.\n^\nSorantin 1932\n,\n[\npage needed\n]\n.\n^\nDavies 1994\n,\n[\npage needed\n]\n.\n^\nRead 1969\n,\n[\npage needed\n]\n;\nStone 1980\n,\n[\npage needed\n]\n.\n^\nCastan 2009\n.\n^\nBent 1987\n, 6.\n^\nQuoted in\nBernard 1981\n, 1\n^\nSchenker described the concept in a paper titled\nErläuterungen\n(\"Elucidations\"), which he published four times between 1924 and 1926:\nDer Tonwille\n(Vienna, Tonwille Verlag, 1924) vol. 8–9, pp. 49–51, vol. 10, pp. 40–42;\nDas Meisterwerk in der Musik\n(München, Drei Masken Verlag), vol. 1 (1925), pp. 201–05; 2 (1926), pp. 193–97. English translation,\nDer Tonwille\n, Oxford University Press, vol. 2, pp. 117–18 (the translation, although made from vols. 8–9 of the German original, gives as original pagination that of\nDas Meisterwerk\n1; the text is the same). The concept of tonal space is still present in\nSchenker (1979\n, especially p. 14, § 13), but less clearly than in the earlier presentation.\n^\nSchenker 1979\n, p. 15, § 21.\n^\nSnarrenberg 1997\n,\n[\npage needed\n]\n.\n^\nLewin 1987\n, 159.\n^\nTan, Peter, and Rom 2010\n, 2.\n^\nThompson n.d.\n, 320.\n^\nSamson n.d\n.\n^\nWong 2011\n.\n^\nGreen 1979\n, 1.\n^\nvan der Merwe 1989\n, 3.\n^\nMoore 2001\n, 432–33.\n^\nLaurie 2014\n, 284.\n^\nKivy 1993\n, 327.\n^\nSmith Brindle 1987\n, 42–43.\n^\nSmith Brindle 1987\n, chapter 6,\npassim\n.\n^\nGarland and Kahn 1995\n,\n[\npage needed\n]\n.\n^\nSmith Brindle 1987\n, 42.\n^\nPurwins 2005\n, 22–24.\n^\nWohl 2005\n.\n^\nBandur 2001\n, 5, 12, 74;\nGerstner 1964\n, passim\n^\nWhittall 2008\n, 273.\n^\nGrant 2001\n, 5–6.\n^\nMiddleton 1990\n, 172.\n^\nNattiez 1976\n.\n^\nNattiez 1990\n.\n^\nNattiez1989\n.\n^\nStefani 1973\n.\n^\nStefani 1976\n.\n^\nBaroni 1983\n.\n^\nSemiotica\n1987\n, 66:1–3.\nsfn error: no target: CITEREFSemiotica1987 (\nhelp\n)\n^\nDunsby & Stopford 1981\n, 49–53.\n^\nMeeùs 2017\n, 81–96.\n^\na\nb\nMcCreless n.d\n.\n^\nMeeùs 2015\n, 111.\nSources\n[\nedit\n]\nAvison, Charles\n(1752).\nAn Essay on Musical Expression\n. London: C. Davis.\nBandur, Markus. 2001.\nAesthetics of Total Serialism: Contemporary Research from Music to Architecture\n. Basel, Boston and Berlin: Birkhäuser.\nBaroni, Mario (1983). \"The Concept of Musical Grammar\", translated by Simon Maguire and William Drabkin.\nMusic Analysis\n2, no. 2:175–208.\nBartlette, Christopher, and Steven G. Laitz (2010).\nGraduate Review of Tonal Theory\n. New York: Oxford University Press.\nISBN\n978-0-19-537698-2\n.\nBent, Ian (1987).\nAnalysis\n, The New Grove Handbooks in Music\nISBN\n0-333-41732-1\n.\nBenward, Bruce, and Marilyn Nadine Saker (2003).\nMusic: In Theory and Practice\n, seventh edition, 2 volumes. Boston: McGraw-Hill\nISBN\n978-0-07-294262-0\n.\nBernard, Jonathan (1981). \"Pitch/Register in the Music of Edgar Varèse.\"\nMusic Theory Spectrum\n3: 1–25.\nBoethius, Anicius Manlius Severinus\n(1989).\nClaude V. Palisca\n(ed.).\nFundamentals of Music\n(PDF)\n(Translation of\nDe institutione musica\n). Translated by Calvin M. Bower. New Haven and London: Yale University Press.\nISBN\n978-0-300-03943-6\n– via classicalliberalarts.com.\nBrandt, Anthony (2007). \"\nMusical Form\n\".\nConnexions\n(11 January; accessed 11 September 2011).\n[\nunreliable source?\n]\nCastan, Gerd (2009). \"\nMusical Notation Codes\n\".\nMusic-Notation.info\n(Accessed 1 May 2010).\nChristiani, Adolph Friedrich (1885).\nThe Principles of Expression in Pianoforte Playing\n. New York: Harper & Brothers.\nDahlhaus, Carl\n(2009). \"Harmony\".\nGrove Music Online\n, edited by Deane Root (reviewed 11 December; accessed 30 July 2015).\nDarwin, Charles\n(1913).\nThe Expression of the Emotions in Man and Animals\n. New York: D. Appleton and Company.\nDavies, Stephen (1994).\nMusical Meaning and Expression\n. Ithaca: Cornell University Press.\nISBN\n978-0-8014-8151-2\n.\nd'Erlanger, Rodolphe (ed. and trans.) (1930–56).\nLa Musique arabe\n, six volumes. Paris: P. Geuthner.\nDunsby, Jonathan\n; Stopford, John (1981). \"The Case for a Schenkerian Semiotic\".\nMusic Theory Spectrum\n.\n3\n:\n49–\n53.\ndoi\n:\n10.2307/746133\n.\nJSTOR\n746133\n.\nEkwueme, Laz E. N.\n(1974). \"Concepts of African Musical Theory\".\nJournal of Black Studies\n5, no. 1 (September): 35–64\nForsyth, Cecil\n(1935).\nOrchestration\n, second edition. New York: Dover Publications.\nISBN\n0-486-24383-4\n.\nGarland, Trudi Hammel, and Charity Vaughan Kahn (1995).\nMath and Music: Harmonious Connections\n. Palo Alto: Dale Seymour Publications.\nISBN\n978-0-86651-829-1\n.\nGerstner, Karl\n. 1964.\nDesigning Programmes: Four Essays and an Introduction\n, with an introduction to the introduction by\nPaul Gredinger\n. English version by D. Q. Stephenson. Teufen, Switzerland: Arthur Niggli. Enlarged, new edition 1968.\nGhrab, Anas (2009). \"\nCommentaire anonyme du Kitāb al-Adwār. Édition critique, traduction et présentation des lectures arabes de l'œuvre de Ṣafī al-Dīn al-Urmawī\n\". PhD thesis. Paris: University Paris-Sorbonne.\nGrant, M[orag] J[osephine] (2001).\nSerial Music, Serial Aesthetics: Compositional Theory in Post-War Europe\n. Music in the Twentieth Century,\nArnold Whittall\n, general editor. Cambridge and New York: Cambridge University Press.\nISBN\n0-521-80458-2\n.\nGreen, Douglass M. (1979).\nForm in Tonal Music\n. Fort Worth: Harcourt Brace Jovanovich College Publishers; New York and London: Holt, Rinehart and Winston.\nISBN\n0-03-020286-8\n.\nHartmann, William M.\n(2005).\nSignals, Sound, and Sensation\n, corrected, fifth printing. Modern Acoustics and Signal Processing. Woodbury, New York: American Institute of Physics; New York: Springer.\nISBN\n1563962837\n.\nJamini, Deborah (2005).\nHarmony and Composition: Basics to Intermediate\n, with DVD video. Victoria, BC: Trafford. 978-1-4120-3333-6.\nKárolyi, Otto\n(1965).\nIntroducing Music\n.\n[\nfull citation needed\n]\n: Penguin Books.\nKilmer, Anne D. (1971). \"The Discovery of an Ancient Mesopotamian Theory of Music\".\nProceedings of the American Philosophical Society\n115, no. 2:131–149.\nKilmer, Anne, and Sam Mirelman. n.d. \"\nMesopotamia. 8. Theory and Practice\n\".\nGrove Music Online\n. Oxford Music Online. Accessed 13 November 2015.\n(subscription required)\nKivy, Peter\n(1993).\nThe Fine Art of Repetition: Essays in the Philosophy of Music\n. Cambridge and New York: Cambridge University Press.\nISBN\n978-0-521-43462-1\n,\n978-0-521-43598-7\n(cloth & pbk).\nKliewer, Vernon (1975). \"Melody: Linear Aspects of Twentieth-Century Music\". In\nAspects of Twentieth-Century Music\n, edited by Gary Wittlich, 270–321. Englewood Cliffs, New Jersey: Prentice-Hall.\nISBN\n0-13-049346-5\n.\nKramer, Jonathan D.\n(1988).\nThe Time of Music: New Meanings, New Temporalities, New Listening Strategies\n. New York: Schirmer Books.\nKubik, Gerhard\n(2010).\nTheory of African Music\n, 2 vols. Chicago: University of Chicago Press.\nISBN\n0-226-45691-9\n.\nKümmel, H. M.\n[\nde\n]\n(1970). \"Zur Stimmung der babylonischen Harfe\".\nOrientalia\n39:252–263.\nLam, Joseph S. C.\n\"China, §II, History and Theory\"\n.\nGrove Music Online\n. Oxford University Press.\nLatham, Alison (ed.) (2002).\nThe Oxford Companion to Music\n. Oxford and New York: Oxford University Press.\nISBN\n0-19-866212-2\n.\nLaurie, Timothy (2014). \"Music Genre as Method\".\nCultural Studies Review\n20, no. 2:283–292.\nLerdahl, Fred\n, and\nRay Jackendoff\n(1985).\nA Generative Theory of Tonal Music\n. Cambridge, Massachusetts: MIT Press.\nISBN\n0262260913\nLewin, David\n(1987).\nGeneralized Musical Intervals and Transformations\n. New Haven: Yale University Press.\nLinkels, Ad. n.d. \"The Real Music of Paradise\". In\nWorld Music\n, Vol. 2: Latin & North America, Caribbean, India, Asia and Pacific, edited by Simon Broughton and Mark Ellingham, with James McConnachie and Orla Duane, 218–229.\n[\nfull citation needed\n]\n: Rough Guides, Penguin Books.\nISBN\n1-85828-636-0\n.\nLondon, Justin (2004).\nHearing in Time: Psychological Aspects of Musical Meter\n. Oxford and New York: Oxford University Press.\n[\nISBN missing\n]\nLondon, Justin (n.d.), \"\nMusical Expression and Musical Meaning in Context\n. ICMPC2000 Proceedings Papers.\nLussy, Mathis (1892).\nMusical Expression: Accents, Nuances, and Tempo, in Vocal and Instrumental Music\n, translated by Miss M. E. von Glehn. Novello, Ewer, and Co.'s Music Primers 25. London: Novello, Ewer and Co.; New York: H. W. Gray\nMcAdams, Stephen, and\nAlbert Bregman\n(1979). \"Hearing Musical Streams\".\nComputer Music Journal\n3, no. 4 (December): 26–43, 60.\nJSTOR\n4617866\nMcCreless, Patrick. n.d. \"Society for Music Theory\",\nGrove Music Online\n. Oxford University Press.\nMalm, William P.\n(1996).\nMusic Cultures of the Pacific, the Near East, and Asia\n, third edition.\nISBN\n0-13-182387-6\n.\nManik, Liberty (1969).\nDas Arabische Tonsystem im Mittelalter\n. Leiden: E. J. Brill.\nMannell, Robert (n.d.).\n\"Spectral Analysis of Sounds\"\n.\nMacquarie University\n.\nMeeùs, Nicolas (2015). \"Épistémologie d’une musicologie analytique\".\nMusurgia\n22, nos. 3–4:97–114.\nMeeùs, Nicolas (2017). \"Schenker's\nInhalt\n, Schenkerian Semiotics. A Preliminary Study\".\nThe Dawn of Music Semiology. Essays in Honor of Jean-Jacques Nattiez\n, J. Dunsby and J. Goldman ed. Rochester: Rochester University Press:81–96.\nMiddleton, Richard\n(1990).\nStudying Popular Music\n. Milton Keynes and Philadelphia: Open University Press.\nISBN\n978-0335152766\n,\n978-0335152759\n(cloth & pbk).\nMiddleton, Richard (1999). \"Form\". In\nKey Terms in Popular Music and Culture\n, edited by Bruce Horner and\nThomas Swiss\n.\n[\npage needed\n]\nMalden, Massachusetts: Blackwell Publishing.\nISBN\n0-631-21263-9\n.\nMirelman, Sam (2010). \"A New Fragment of Music Theory from Ancient Iraq\".\nArchiv für Musikwissenschaft\n67, no. 1:45–51.\nMirelman, Sam (2013). \"\nTuning Procedures in Ancient Iraq\n\".\nAnalytical Approaches to World Music\n2, no. 2:43–56.\nMitchell, Barry (2008). \"\nAn Explanation for the Emergence of Jazz (1956)\n\",\nTheory of Music\n(16 January):\n[\npage needed\n]\n.\n[\nunreliable source?\n]\nMoore, Allan F. (2001). \"\nCategorical Conventions in Music Discourse: Style and Genre\n\".\nMusic & Letters\n82, no. 3 (August): 432–442.\nNattiez, Jean-Jacques\n(1976).\nFondements d'une sémiologie de la musique\n. Collection Esthétique. Paris: Union générale d'éditions.\nISBN\n978-2264000033\n.\nNattiez, Jean-Jacques(1989).\nProust as Musician\n, translated by Derrick Puffett. Cambridge and New York: Cambridge University Press.\nISBN\n978-0-521-36349-5\n,\n978-0-521-02802-8\n.\nNattiez, Jean-Jacques (1990).\nMusic and Discourse: Toward a Semiology of Music\n, translated by\nCarolyn Abbate\nof\nMusicologie generale et semiologie\n. Princeton: Princeton University Press.\nISBN\n978-0-691-09136-5\n(cloth);\nISBN\n978-0-691-02714-2\n(pbk).\n\"theory,\nn\n.\n1\n\"\n.\nOxford English Dictionary\n(Online ed.).\nOxford University Press\n.\n(Subscription or\nparticipating institution membership\nrequired.)\nPalisca, Claude V.\n, and\nIan D. Bent\n. n.d. \"Theory, Theorists\".\nGrove Music Online\n, edited by Deane Root. Oxford University Press (accessed 17 December 2014).\nPurwins, Hendrik (2005). \"\nProfiles of Pitch Classes Circularity of Relative Pitch and Key: Experiments, Models, Computational Music Analysis, and Perspectives\n\". Doktor der Naturwissenschaften diss. Berlin: Technischen Universität Berlin.\nRead, Gardner\n(1969).\nMusic Notation: A Manual of Modern Practice\n, second edition. Boston, Allyn and Bacon. Reprinted, London: Gollancz, 1974.\nISBN\n9780575017580\n. Reprinted, London: Gollancz, 1978.\nISBN\n978-0575025547\n. Reprinted, New York: Taplinger Publishing, 1979.\nISBN\n978-0800854591\n,\n978-0800854539\n.\nSamson, Jim\n. \"\nGenre\n\". In\nGrove Music Online\n, edited by Deane Root. Oxford Music Online. Accessed 4 March 2012\nSchenker, Heinrich\n(1979).\nFree Composition\n. Translated and edited by\nErnst Oster\n. New York and London, Longman.\nSchoenberg, Arnold\n(1983).\nStructural Functions of Harmony\n, revised edition with corrections, edited by\nLeonard Stein\n. London and Boston: Faber and Faber.\nISBN\n978-0-571-13000-9\n.\nScholes, Percy A.\n(1977). \"Form\".\nThe Oxford Companion to Music\n, tenth edition. Oxford and New York: Oxford University Press.\nService, Jonathan (2013). \"\nChinese Music Theory\n\".\nTransmission/Transformation: Sounding China in Enlightenment Europe\n. Cambridge: Harvard University Department of Music (web, accessed 17 December 2015).\nShiloah, Amnon (1964).\nLa perfection des connaissances musicales: Traduction annotée du traité de musique arabe d'al-Ḥasan ibn Aḥmad ibn 'Ali al-Kātib\nÉcole pratique des hautes études. 4e section, Sciences historiques et philologiques, Annuaire 1964–1965\n97, no. 1: 451–456.\nSmith Brindle, Reginald\n(1987).\nThe New Music: The Avant-Garde Since 1945\n, second edition. Oxford and New York: Oxford University Press.\nISBN\n978-0-19-315471-1\n,\n978-0-19-315468-1\n(cloth & pbk).\nSnarrenberg, Robert (1997).\nSchenker's Interpretive Practice\n. Cambridge Studies in Music Theory and Analysis 11. Cambridge University Press.\nISBN\n0521497264\n.\nSorantin, Erich (1932).\nThe Problem of Musical Expression: A Philosophical and Psychological Study\n. Nashville: Marshall and Bruce\nStefani, Gino (1973). \"Sémiotique en musicologie\".\nVersus\n5:20–42.\nStefani, Gino (1976).\nIntroduzione alla semiotica della musica\n. Palermo: Sellerio editore.\nStein, Leon\n(1979).\nStructure and Style: The Study and Analysis of Musical Forms\n. Princeton, New Jersey: Summy-Birchard Music.\nISBN\n978-0-87487-164-7\n.\nStone, Kurt (1980).\nMusic Notation in the Twentieth Century\n. New York: W. W. Norton.\nISBN\n978-0-393-95053-3\n.\nTan, Siu-Lan, Pfordresher Peter, and Harré Rom (2010).\nPsychology of Music: From Sound to Significance\n. New York: Psychology Press.\nISBN\n978-1-84169-868-7\n.\nThompson, William Forde\n(n.d.).\nMusic, Thought, and Feeling: Understanding the Psychology of Music\n, second edition. New York: Oxford University Press.\nISBN\n0-19-537707-9\n.\nTouma, Habib Hassan\n(1996).\nThe Music of the Arabs\n, new expanded edition, translated by Laurie Schwartz. Portland, Oregon: Amadeus Press.\nISBN\n0-931340-88-8\n.\nvan der Merwe, Peter\n(1989).\nOrigins of the Popular Style: The Antecedents of Twentieth-Century Popular Music\n. Oxford: Clarendon Press.\nISBN\n978-0-19-316121-4\n.\nWhittall, Arnold\n(2008).\nThe Cambridge Introduction to Serialism\n. Cambridge Introductions to Music. New York: Cambridge University Press.\nISBN\n978-0-521-86341-4\n,\n978-0-521-68200-8\n(cloth & pbk).\nWohl, Gennady. (2005). \"\nAlgebra of Tonal Functions\n\", translated by Mykhaylo Khramov. Sonantometry Blogspot (16 June; accessed 31 July 2015).\n[\nunreliable source?\n]\nWong, Janice (2011). \"\nVisualising Music: The Problems with Genre Classification\n\". Masters of Media blog site (accessed 11 August 2015).\n[\nunreliable source?\n]\nWright, Owen (2001a). \"Munajjim, al- [Yaḥyā ibn]\".\nThe New Grove Dictionary of Music and Musicians\n, second edition, edited by\nStanley Sadie\nand\nJohn Tyrrell\n. London: Macmillan. Reprinted in\nGrove Music Online\n, Oxford Music Online.\n(subscription required)\n.\nWright, Owen (2001b). \"\nArab Music, §1: Art Music, 2. The Early Period (to 900 CE), (iv) Early Theory\n\".\nThe New Grove Dictionary of Music and Musicians\n, second edition, edited by Stanley Sadie and John Tyrrell. London: Macmillan. Reprinted in\nGrove Music Online\n, Oxford Music Online.\n(subscription required)\n.\nWulstan, David (1968). \"The Tuning of the Babylonian Harp\".\nIraq\n30: 215–28.\nYeston, Maury\n(1976).\nThe Stratification of Musical Rhythm\n. New Haven: Yale University Press.\nFurther reading\n[\nedit\n]\nApel, Willi\n; Daniel, Ralph T. (1960).\nThe Harvard Brief Dictionary of Music\n. New York: Simon & Schuster Inc.\nISBN\n0-671-73747-3\n.\n{{\ncite book\n}}\n:\nISBN / Date incompatibility (\nhelp\n)\nAristoxenus\n(1902).\nAristoxenou Harmonika stoicheia: The Harmonics of Aristoxenus\n, Greek text edited with an English translation and notes by Henry Marcam. Oxford: The Clarendon Press.\nBakkegard, B. M.; Morris, E. A. (1961). \"Seventh Century Flutes from Arizona\".\nEthnomusicology\n.\n5\n(3): 184.\ndoi\n:\n10.2307/924518\n.\nJSTOR\n924518\n.\nBakshi, Haresh (2005).\n101 Raga-s for the 21st Century and Beyond: A Music Lover's Guide to Hindustani Music\n. Victoria, British Columbia: Trafford.\nISBN\n978-1412046770\n,\n978-1412231350\n(ebook).\nBaur, John (2014).\nPractical Music Theory\n. Dubuque: Kendall-Hunt Publishing Company.\nISBN\n978-1-4652-1790-5\nBenade, Arthur H. (1960).\nHorns, Strings, and Harmony\n. Science Study Series S 11. Garden City, New York: Doubleday\nBent, Ian D.\n, and\nAnthony Pople\n(2001). \"Analysis.\"\nThe New Grove Dictionary of Music and Musicians\n, second edition, edited by\nStanley Sadie\nand\nJohn Tyrrell\n. London: Macmillan.\nBenward, Bruce, Barbara Garvey Jackson, and Bruce R. Jackson. (2000).\nPractical Beginning Theory: A Fundamentals Worktext\n, 8th edition, Boston: McGraw-Hill.\nISBN\n0-697-34397-9\n. [First edition 1963]\nBenward, Bruce, and Marilyn Nadine Saker (2009).\nMusic in Theory and Practice\n, eighth edition, vol. 2. Boston: McGraw-Hill.\nISBN\n978-0-07-310188-0\n.\nBillmeier, Uschi (1999).\nMamady Keïta: A Life for the Djembé – Traditional Rhythms of the Malinké\n, fourth edition. Kirchhasel-Uhlstädt: Arun-Verlag.\nISBN\n978-3-935581-52-3\n.\nBoretz, Benjamin\n(1995).\nMeta-Variations: Studies in the Foundations of Musical Thought\n. Red Hook, New York: Open Space.\nBoth, Arnd Adje (2009). \"Music Archaeology: Some Methodological and Theoretical Considerations\".\nYearbook for Traditional Music\n41:1–11.\nJSTOR\n25735475\nBregman, Albert\n(1994).\nAuditory Scene Analysis: The Perceptual Organization of Sound\n. Cambridge: MIT Press.\nISBN\n0-262-52195-4\n.\nBrill, Mark\n(2012). \"Music of the Ancient Maya: New Venues of Research\". Paper presented at AMS-SW Conference Fall 2012. Texas State University\n[\nfull citation needed\n]\nBrown, James Murray (1967).\nA Handbook of Musical Knowledge\n, 2 vols. London: Trinity College of Music.\nCavanagh, Lynn (1999).\n\"A Brief History of the Establishment of International Standard Pitch A=440 Hertz\"\n(PDF)\n. Archived from\nthe original\n(PDF)\non 25 March 2009.\n(Accessed 1 May 2010)\nCharry, Eric (2000).\nMande Music: Traditional and Modern Music of the Maninka and Mandinka of Western Africa\n. Chicago: University of Chicago Press.\nISBN\n978-0-226-10161-3\n.\nCheong, Kong F. (2012). \"A Description of the Ceramic Musical Instruments Excavated from the North Group of Pacbitun, Belize\". In\nPacbitun Regional Archaeological Project, Report on the 2011 Field Season\n, edited by Terry G. Powis, 15–29. Belmopan, Belize: Institute of Archaeology.\nChernoff, John (1981).\nAfrican Rhythm and African Sensibility: Aesthetics and Social Action in African Musical Idioms\n. Chicago: University of Chicago Press.\nISBN\n978-0-226-10345-7\n.\nCivil, Miguel (2010). \"The Lexical Texts in the Schøyen Collection\".\nCornell University Studies in Assyriology and Sumerology\n12:203–214.\nConfucius\n(1999).\nThe Analects of Confucius\n, edited by\nRoger T. Ames\nand Henry Rosemont Jr.\n[\nclarification needed\n]\nBallantine Books.\nISBN\n0345434072\n.\nConrad, Nicholas J., Maria Malina, and Susanne C. Münzel (2009). \"New Flutes Document the Earliest Musical Tradition in Southwestern Germany\".\nNature\n460, no. 7256 (6 August): 737–740.\nCrease, Robert P.\n(2011).\nWorld in the Balance: The Historic Quest for an Absolute System of Measurement\n. New York, London: W. W. Norton.\nCrickmore, Leon (2012). \"A Musicological Interpretation of the Akkadan Term Siḫpu\".\nJournal of Cuneiform Studies\n.\n64\n(1):\n57–\n64.\ndoi\n:\n10.5615/jcunestud.64.0057\n.\nISSN\n0022-0256\n.\nChase, Wayne (2006).\nHow Music REALLY Works!\n, second edition. Vancouver, Canada: Roedy Black Publishing.\nISBN\n1-897311-55-9\n(book).\nd'Errico, Francesco\n,\nChristopher Henshilwood\n, Graeme Lawson, Marian Vanhaeren, Anne-Marie Tillier, Marie Soressi, Frederique Bresson, Bruno Maureille, April Nowell, Joseba Lakarra, Lucinda Backwell, Michele Julien (2003). \"\nArchaeological Evidence for the Emergence of Language, Symbolism, and Music – An Alternative Multidisciplinary Perspective\n\".\nJournal of World Prehistory\n17, no. 1 (March): 1–70.\nDespopoulos, Agamemnon, and Stefan Silbernagl (2003).\nColor Atlas of Physiology\n, fifth edition. New York and Stuttgart: Thieme.\nISBN\n3-13-545005-8\n.\nDietrich, Manfried\n[in German]\n;\nLoretz, Oswald\n[in German]\n(1975). \"Kollationen zum Musiktext aus Ugarit\".\nUgarit-Forschungen\n.\n7\n:\n521–\n22.\nDunbar, Brian (2010).\nPractical Music Theory: A Guide to Music as Art, Language, and Life\n. Rochester, MN: Factum Musicae.\nISBN\n978-0578062471\n.\nGross, Clint (n.d.).\n\"Anasazi Flutes from the Broken Flute Cave\"\n.\nFlutopedia\n. Clint Gross\n. Retrieved\n4 December\n2014\n.\nSolis, R. S.; Haas, J.; Creamer, W. (27 April 2001). \"Dating Caral, a preceramic site in the Supe Valley on the central coast of Peru\".\nScience\n.\n292\n(5517):\n723–\n726.\nBibcode\n:\n2001Sci...292..723S\n.\ndoi\n:\n10.1126/science.1059519\n.\nISSN\n0036-8075\n.\nPMID\n11326098\n.\nHarnsberger, Lindsey C. (1997). \"Articulation\".\nEssential Dictionary of Music: Definitions, Composers, Theory, Instrument and Vocal Ranges\n, second edition. The Essential Dictionary Series. Los Angeles: Alfred Publishing.\nISBN\n0-88284-728-7\n.\nHewitt, Michael (2008).\nMusic Theory for Computer Musicians\n. Boston, MA: Course Technology Ptr.\nISBN\n978-1-59863-503-4\n.\nOCLC\n185033110\n.\nHoutsma, Adrianus JM. (1995).\n\"Pitch perception\"\n. In Moore, B.C.J. (ed.).\nHearing\n. Handbook of Perception and Cognition (Second ed.). Elsevier Science. pp.\n267–\n295.\nISBN\n978-0-08-053386-5\n.\nHuang, Xiang-peng (黄翔鹏) (1989). \"Wuyang Jiahu gudi de ceyin yanjiu (舞阳贾湖骨笛的测音研究)\" [Pitch Measurement Studies of Bone Flutes from Jiahu of Wuyang County].\nWenwu\n(文物) [Cultural Relics], no. 1:15–17. Reprinted in 黄翔鹏文存 [Collected Essays of Huang Xiang-Peng], 2 vols, edited by Zhongguo Yishu Yanjiuyuan Yinyue Yanjiusuo (中国艺术研究院音乐研究所), 557–560. Ji'nan, China: Shandong Wenyi Chubanshe, 2007.\nISBN\n978-7-5329-2669-5\n.\nHung, Eric (2012). \"\nWestern University, Don Wright Faculty of Music: Tenure-Track Appointment in Music Theory\n\". Toronto: MusCan.\nJackendoff, Ray\n;\nLerdahl, Fred\n(1981).\n\"Generative Music Theory and Its Relation to Psychology\"\n.\nJournal of Music Theory\n.\n25\n(1). [Duke University Press, Yale University Department of Music]:\n45–\n90.\nISSN\n0022-2909\n.\nJSTOR\n843466\n.\nJosephs, Jess L. (1967).\nThe Physics of Musical Sound\n. Princeton, Toronto, and London: D. Van Nostrand Company.\nKostka, Stefan\n, and Dorothy Payne (2004).\nTonal Harmony\n, fifth edition. New York: McGraw-Hill.\nKubik, Gerhard\n(1998).\nKalimba—Nsansi—Mbira. Lamellophone in Afrika\n. Berlin: Museum fur Volkerkunde.\nISBN\n3886094391\n.\nLaroche, Emmanuel\n(1955).\nLe palais royal d' Ugarit 3: Textes accadiens et hourrites des archives est, ouest et centrales\n. Paris: C. Klincksieck\nLawn, Richard J., and Jeffrey L. Hellmer (1996).\nJazz Theory and Practice\n. [n.p.]: Alfred Publishing Co.\nISBN\n0-88284-722-8\n.\nLee, Yuan-Yuan, and Sin-Yan Shen (1999).\nChinese Musical Instruments\n. Chinese Music Monograph Series. Chicago: Chinese Music Society of North America Press.\nISBN\n1880464039\n.\nLerdahl, Fred\n(2001).\nTonal Pitch Space\n. Oxford: Oxford University Press.\nLloyd, Llewellyn S., and Hugh Boyle (1978).\nIntervals, Scales and Temperaments\n. New York: St. Martin's Press.\nISBN\n0-312-42533-3\n.\nLu, Liancheng (2005). \"The Eastern Zhou and the Growth of Regionalism\". In\nThe Formation of Chinese Civilization\n, edited by\nSarah Allan\n, 203–248. New Haven and London: Yale University Press.\nISBN\n978-0-300-09382-7\n.\nMann, Alfred\n, J. Kenneth Wilson, and Peter Urquhart. n.d. \"Canon (i).\"\nGrove Music Online\n. Oxford Music Online (Accessed 2 January 2011)\n(subscription required)\n.\nMazzola, Guerino (1985).\nGruppen und Kategorien in der Musik: Entwurf einer mathematischen Musiktheorie\n. Heldermann.\nISBN\n978-3-88538-210-2\n. Retrieved\n26 February\n2012\n.\nMazzola, Guerino; Daniel Muzzulini (1990).\nGeometrie der Töne: Elemente der mathematischen Musiktheorie\n. Birkhäuser.\nISBN\n978-3-7643-2353-0\n. Retrieved\n26 February\n2012\n.\nMazzola, Guerino; Stefan Göller; Stefan Müller (2002).\nThe Topos of Music: Geometric Logic of Concepts, Theory, and Performance, Vol. 1\n. Basel, Boston, and Berlin: Birkhäuser.\nISBN\n978-3-7643-5731-3\n. Retrieved\n26 February\n2012\n.\nMuni, Bharata\n(1951).\nNatya Shastra\n. Calcutta: Asiatic Society of Bengal.\n(\nText at archive.org\n)\nMiguel, Roig-Francoli (2011).\nHarmony in Context\n, Second edition, McGraw-Hill Higher Education.\nISBN\n0073137944\n.\nMirelman, Sam; Krispijn, Theo J. H. (2009).\n\"The Old Babylonian tuning text UET VI/3 899\"\n(PDF)\n.\nIraq\n.\n71\n. Cambridge University Press (CUP):\n43–\n52.\ndoi\n:\n10.1017/s0021088900000735\n.\nISSN\n0021-0889\n.\nNave, R. (n.d.). \"\nFrequencies for Maximum Sensitivity of Human Hearing\n\", Hyperphysics website, Georgia State University (accessed 5 December 2014).\nOlson, Steve\n(2011). \"\nA Grand Unified Theory of Music\n\".\nPrinceton Alumni Weekly\n111, no. 7 (9 February) (Online edition accessed 25 September 2012).\nOlson, Harry F.\n(1967).\nMusic, Physics and Engineering\n. New York: Dover Publications.\nISBN\n978-0-486-21769-7\n.\nOwen, Harold (2000).\nMusic Theory Resource Book\n. Oxford University Press.\nISBN\n0-19-511539-2\n.\nPtolemy\n(1999).\nHarmonics\n, translation and commentary by Jon Solomon. Mnemosyne, bibliotheca classica Batava: Supplementum 203. Leiden and Boston: Brill Academic Publications.\nISBN\n9004115919\n.\nRandel, Don Michael\n(ed.) (2003).\nThe Harvard Dictionary of Music\n, fourth edition, 260–262. Cambridge: The Belknap Press for Harvard University Press.\nISBN\n978-0674011632\n[\nfull citation needed\n]\nRoss, John (August 2002). \"First City in the New World?\".\nSmithsonian\n.\n33\n(5):\n56–\n63.\nSchaeffer, Claude; Nougayrol, Jean, eds. (n.d.). \"Documents en langue houritte provenent de Ras Shamra\".\nUgaritica 5: Nouveaux Textes Accadiens, Hourrites et Ugaritiques des Archives et Bibliothèques Privées d'Ugarit\n. Paris: Bibliothèque archéologique et historique / Institut français d'archéologie de Beyrouth 80:\n462–\n496.\nSeashore, Carl\n(1933).\nApproaches to the Science of Music and Speech\n. Iowa City: The university.\nSeashore, C.E. (1967).\nPsychology of Music\n. Dover books on music. Dover Publications.\nISBN\n978-0-486-21851-9\n.\nShiloah, Amnon (2003).\nMusic in the World of Islam: A Socio-Cultural Study\n. Detroit: Wayne State University Press.\nISBN\n978-0814329702\n.\nSorce, Richard (1995).\nMusic Theory for the Music Professional\n. [N.p.]: Ardsley House.\nISBN\n1-880157-20-9\n.\nStevens, S. S., J. Volkmann, and E. B. Newman (1937). \"A Scale for the Measurement of the Psychological Magnitude Pitch\".\nJournal of the Acoustical Society of America\n8, no. 3:185–190.\nTaruskin, Richard\n(2009).\nMusic from the Earliest Notations to the Sixteenth Century: The\nOxford History of Western Music\n.\nOxford University Press\nISBN\n0195384814\n.\nTaylor, Eric (1989).\nAB Guide to Music Theory, Part 1\n. London: Associated Board of the Royal Schools of Music.\nISBN\n1-85472-446-0\n.\nTaylor, Eric (1991).\nAB Guide to Music Theory, Part 2\n. London: Associated Board of the Royal Schools of Music.\nISBN\n1-85472-447-9\n.\nThrasher, Alan (2000).\nChinese Musical Instruments\n. London and New York: Oxford University Press.\nISBN\n0-19-590777-9\n.\nTracey, Hugh\n(1969). \"The Mbira Class of African Instruments in Rhodesia\".\nAfrican Music Society Journal\n4, no. 3:78–95.\nTymoczko, Dmitri\n(2011).\nA Geometry of Music: Harmony and Counterpoint in the Extended Common Practice\n. Oxford Studies in Music Theory. Oxford and New York: Oxford University Press.\nISBN\n978-0195336672\n.\nWest, Martin Litchfield\n(1994). \"The Babylonian Musical Notation and the Hurrian Melodic Texts\".\nMusic & Letters\n75, no. 2 (May): 161–179\nWu, Zhao (吴钊) (1991). \"Jiahu guiling gudi yu Zhongguo yinyue wenming zhi yuan (贾湖龟铃骨笛与中国音乐文明之源)\" [The relation of Jiahu bone flutes and turtle shell shakers to the origin of Chinese music].\nWenwu\n(文物) [Cultural Relics], no. 3: 50–55.\nWu, Zhongzian, and Karin Taylor Wu (2014).\nHeavenly Stems and Earthly Branches: Tian Gan Dizhi, The Heart of Chinese Wisdom Traditions\n. London and Philadelphia: Singing Dragon (Jessica Kingsley Publishers).\nYamaguchi, Masaya (2006).\nThe Complete Thesaurus of Musical Scales\n, revised edition. New York: Masaya Music Services.\nISBN\n0-9676353-0-6\n.\nZhang, Juzhong; Harbottle, Garman; Wang, Changsui; Kong, Zhaochen (23 September 1999).\n\"Oldest playable musical instruments found at Jiahu early Neolithic site in China\"\n(PDF)\n.\nNature\n.\n401\n(6751). Springer Science and Business Media LLC:\n366–\n368.\ndoi\n:\n10.1038/43865\n.\nISSN\n0028-0836\n.\nPMID\n16862110\n.\nJuzhong, Zhang; Kuen, Lee Yun (2005). \"The Magic Flutes\".\nNatural History\n.\n114\n(7). American Museum of natural history:\n43–\n47.\nISSN\n0028-0712\n.\nZhang, Juzhong; Xiao, Xinghua; Lee, Yun Kuen (2004).\n\"The early development of music. Analysis of the Jiahu bone flutes\"\n(PDF)\n.\nAntiquity\n.\n78\n(302). Cambridge University Press (CUP):\n769–\n778.\ndoi\n:\n10.1017/s0003598x00113432\n.\nISSN\n0003-598X\n.\nExternal links\n[\nedit\n]\nWikimedia Commons has media related to\nMusic theory\n.\nWikibooks has more on the topic of:\nMusic theory\nLibrary resources\nabout\nMusic theory\nOnline books\nResources in your library\nDillen, Oscar van\n,\nOutline of basic music theory\n(2011)\nv\nt\ne\nMusic theory\nAesthetics\nAnalysis\nAspects\nComposition\nDefinition\nMathematics\nMusicology\nPhilosophy\nPsychology\nSet theory\nTuning\nList of music theorists\nv\nt\ne\nMusic\nHistory of music\nPrehistoric\nAncient\nDance\nMartial\nReligious\nBiblical\nSecular\nArt music\nAfghan classical music—Klasik\nAndalusi classical music\nArabic music\nAzerbaijani Mugham\nBurmese classical music—Mahāgīta\nCambodian ceremonial music—Pinpeat\nChinese traditional music\nIndian classical music\nByzantine music\nIndonesian art music—Gamelan\nJapanese court music—Gagaku\nKorean court music\nLao classical music\nMandé art music\nOttoman music\nPersian classical music\nPhilippine art songs—Kundiman\nScottish Ceòl Mór\nKandyan dance of Sri Lanka\nThai classical music—Piphat\nVietnam imperial court music—Nhã nhạc\nWestern classical music\nVernacular\nmusic\nCircus music\nFolk music\nBlues\nCountry music\nElectronic music\nHip hop music\nJazz\nPop music\nProgressive music\nPsychedelic music\nSoul music\nMusical instruments\nArched Harp\nAngular harp\nHistory of the harpsichord\nHistory of lute-family instruments\nNafir\nEvolution of timpani in the 18th and 19th centuries\nHistory of the trumpet\nHistory of the violin\nMusician\nEnsembles\nBand (rock and pop)\nBackup band\nAll-female band\nRhythm section\nBig band\nConcert band\nDisc jockey\nMilitary band\nLead vocalist\nBacking vocalist\nTheory\nComposition\nForm\nGenre\nNotation\nImprovisation\nLyrics\nSinging\nSong\nTechnique\nEducation\nand study\nBachelor of Music\nMaster of Music\nDoctor of Musical Arts\nPhD\nMethod\nMusic archaeology\nMusic history\nMusic psychology\nMusic school\nComposition\nMusicology\nBiomusicology\nCognitive musicology\nComputational musicology\nEcomusicology\nEthnomusicology\nNew musicology\nOrganology\nSociomusicology\nZoomusicology\nProduction\nSingle\nA-side and B-side\nExtended play\nCompilation\nLive\nRemix\nAudio engineer\nRecord label\nRecord producer\nSampling\nMusic technology (electric)\nMusic technology (electronic and digital)\nSound recording and reproduction\nCover\nRemix\nCultural and\nregional genres\nAfrican\nCentral\nEast\nNorth\nSouthern\nWest\nAsian\nCentral\nEast\nMiddle Eastern\nSouth\nSoutheast\nEuropean\nBalkan\nNordic\nLatin American\nCentral American\nSouth American\nNorth American\nCaribbean\nOceanian\nMelanesian\nMicronesian\nPolynesian\nBy sovereign state\nAfghanistan\nAlbania\nAlgeria\nAndorra\nAngola\nAntigua and Barbuda\nArgentina\nArmenia\nAustralia\nAustria\nAzerbaijan\nBahamas\nBahrain\nBangladesh\nBarbados\nBelarus\nBelgium\nBelize\nBenin\nBhutan\nBolivia\nBosnia and Herzegovina\nBotswana\nBrazil\nBrunei\nBulgaria\nBurkina Faso\nBurundi\nCambodia\nCameroon\nCanada\nCape Verde\nCentral African Republic\nChad\nChile\nChina\nColombia\nComoros\nCosta Rica\nCroatia\nCuba\nCyprus\nCzech Republic\nDemocratic Republic of the Congo\nDenmark\nDjibouti\nDominica\nDominican Republic\nEcuador\nEgypt\nEl Salvador\nEquatorial Guinea\nEritrea\nEstonia\nEswatini\nEthiopia\nFederated States of Micronesia\nFiji\nFinland\nFrance\nGabon\nGambia\nGeorgia\nGermany\nGhana\nGreece\nGrenada\nGuatemala\nGuinea\nGuinea-Bissau\nGuyana\nHaiti\nHonduras\nHungary\nIceland\nIndia\nIndonesia\nIran\nIraq\nIreland\nIsrael\nItaly\nIvory Coast\nJamaica\nJapan\nJordan\nKazakhstan\nKenya\nKiribati\nKosovo\nKuwait\nKyrgyzstan\nLaos\nLatvia\nLebanon\nLesotho\nLiberia\nLibya\nLiechtenstein\nLithuania\nLuxembourg\nMadagascar\nMalawi\nMalaysia\nMaldives\nMali\nMalta\nMarshall Islands\nMauritania\nMauritius\nMexico\nMoldova\nMonaco\nMongolia\nMontenegro\nMorocco\nMozambique\nMyanmar\nNamibia\nNauru\nNepal\nNetherlands\nNew Zealand\nNicaragua\nNiger\nNigeria\nNorth Korea\nNorth Macedonia\nNorway\nOman\nPakistan\nPalau\nPalestine\nPanama\nPapua New Guinea\nParaguay\nPeru\nPhilippines\nPoland\nPortugal\nQatar\nRepublic of the Congo\nRomania\nRussia\nRwanda\nSaint Kitts and Nevis\nSaint Lucia\nSaint Vincent and the Grenadines\nSamoa\nSan Marino\nSaudi Arabia\nSenegal\nSerbia\nSeychelles\nSierra Leone\nSingapore\nSlovakia\nSlovenia\nSolomon Islands\nSomalia\nSouth Africa\nSouth Korea\nSouth Sudan\nSpain\nSri Lanka\nSudan\nSuriname\nSweden\nSwitzerland\nSyria\nSão Tomé and Príncipe\nTaiwan\nTajikistan\nTanzania\nThailand\nTimor-Leste\nTogo\nTonga\nTrinidad and Tobago\nTunisia\nTurkey\nTurkmenistan\nTuvalu\nUganda\nUkraine\nUnited Arab Emirates\nUnited Kingdom\nUnited States\nUruguay\nUzbekistan\nVanuatu\nVatican City\nVenezuela\nVietnam\nWestern Sahara\nYemen\nZambia\nZimbabwe\nLists\nIndex\nOutline\nTimeline\nAlbums\nClassical and art music traditions\nClassical music genres\nCultural and regional genres\nInstruments\nJazz and popular music glossary\nMusic genres and styles\nSongs\nTerminology\nrelated articles\nAesthetics of music\nAlbum era\nFictional music\nMusic and emotion\nMusic and exercise\nMusic and fashion\nMusic industry\nMusic and politics\nCensorship\nEnvironmentalism\nWarfare\nMusic and sleep\nMusic community\nMusic festival\nMusic technology\nMusic therapy\nMusical escapism\nMusical instrument\nClassification\nFolk\nWomen in music\nMusic portal\nRecord production portal\nCategory\nv\nt\ne\nWestern classical music\nDefinition\nArt music\nDates of eras\nMajor periods and eras\nEarly music\nMedieval\nRenaissance\nTransition to Baroque\nCommon practice\nBaroque\nGalant\nEmpfindsamkeit\nClassical\nTransition to Romantic\nRomantic\nPost-romanticism\nNew music\nModernism\nContemporary\n20th-century\n21st-century\nBy country\nAustralia\nBrazil\nPorto Alegre\nCanada\nFrance\nGermany\nIreland\nItaly\nKosovo\nRussia\nUnited Kingdom\nBirmingham\nUnited States\nStudents by teacher\nA to B\nC to F\nG to J\nK to M\nN to Q\nR to S\nT to Z\nPerformance\nConcert\nUnruly audience response\nConducting\nMusical ensemble\nOrchestra\nRelated\nAvant-garde\nBaroque pop\nClassical music blog\nExperimental\nLight music\nNew-age music\nProgressive music\nSoundtrack\nFilm score\nVideo game music\nThird stream\nWorldwide traditions\nLists\nGenres\nComposers by era\nFestivals\nOutline\nCategory\nPortal\nWikiProject\nv\nt\ne\nIndian music\nMain\nMusic in ancient India\nIndian classical music\nSemi Classical music/Light classical music\nIndian folk music\nIndian classical music\nCarnatic music\nHindustani music\nOdissi music\nConcepts\nShruti (music)\nSwara\nAlankara\nRāga\nTāla\nPrahar\nHindustani classical music\nTypes of compositions\nDhrupad\nDhamar\nKhyal\nTarana\nThumri\nDadra\nQawwali\nGhazal\nThaats\nBilaval\nKhamaj\nKafi\nAsavari\nBhairav\nBhairavi\nTodi\nPurvi\nMarwa\nKalyan\nPrinciples of Hindustani music\nAlap\nBandish\nGat\nTypes of Bandish\nSthaayi\nAntara\nSanchaari\nAabhog\nVariations of Bandish\nVilambit\nMadhyalaya\nDrut\nSemi-classical music\nNatya Sangeet\nBaithak Gana\nSikh music\nIndian folk music\nRabindra Sangeet\nBihu of Assam\nDandiya\nGanasangeet\nUttarakhandi Music\nLavani\nIndian Light Music\nIndian film music\nMusic of Bollywood\nIndian play music\nNatya Sangeet\nLight songs in the play\nSugama Sangeetha\nRegion wise Indian Music\nBhojpuri\nRajasthani\nKarnataka Sugam sangeet\nGoa trance music\nAndaman and Nicobar Islands\nAndhra Pradesh\nArunachal Pradesh\nAssam\nBihar\nChhattisgarh\nGoa\nGujarat\nHaryana\nHimachal Pradesh\nKashmir, Jammu and Ladakh\nJharkhand\nKarnataka\nKerala\nMadhya Pradesh\nMaharashtra\nManipur\nMeghalaya\nMizoram\nNagaland\nOdisha\nPunjab\nRajasthan\nSikkim\nTamil Nadu\nTripura\nUttar Pradesh\nUttarakhand\nWest Bengal\nLanguage wise Music\nMarathi Music\nHindi music\nKannada music\nTelegu music\nTamil music\nAssami music\nMaharashtra music\nPowada\nGan\nGavlan\nLavani\nKirtan\nAuthority control databases\nInternational\nFAST\nNational\nGermany\nUnited States\nFrance\nBnF data\nJapan\nCzech Republic\n2\nSpain\nIsrael\nOther\nYale LUX\nRetrieved from \"\nhttps://en.wikipedia.org/w/index.php?title=Music_theory&oldid=1279147410\n\"\nCategories\n:\nMusic theory\nMusic history\nMusicology\nHidden categories:\nPages using the Phonos extension\nWikipedia articles needing page number citations from August 2014\nWikipedia articles needing page number citations from October 2014\nWikipedia articles needing page number citations from September 2012\nWikipedia articles needing page number citations from July 2015\nHarv and Sfn no-target errors\nArticles with Encyclopædia Britannica links\nArticles with short description\nShort description is different from Wikidata\nUse dmy dates from August 2021\nCS1: long volume value\nCS1 Greek-language sources (el)\nAll articles lacking reliable references\nArticles lacking reliable references from November 2019\nAll articles with unsourced statements\nArticles with unsourced statements from July 2015\nArticles needing additional references from July 2015\nAll articles needing additional references\nAll self-contradictory articles\nSelf-contradictory articles from March 2020\nAll articles with incomplete citations\nArticles with incomplete citations from December 2021\nArticles with unsourced statements from August 2015\nWikipedia articles needing clarification from July 2015\nAll articles with failed verification\nArticles with failed verification from December 2014\nWikipedia articles needing clarification from November 2018\nArticles with incomplete citations from July 2015\nArticles lacking reliable references from July 2015\nPages containing links to subscription-only content\nPages with missing ISBNs\nCS1 errors: ISBN date\nArticles with incomplete citations from December 2014\nWikipedia articles needing clarification from December 2014\nCS1 interwiki-linked names\nCommons category link from Wikidata\nThis page was last edited on 6 March 2025, at 20:38\n(UTC)\n.\nText is available under the\nCreative Commons Attribution-ShareAlike 4.0 License\n;\nadditional terms may apply. By using this site, you agree to the\nTerms of Use\nand\nPrivacy Policy\n. Wikipedia® is a registered trademark of the\nWikimedia Foundation, Inc.\n, a non-profit organization.\nPrivacy policy\nAbout Wikipedia\nDisclaimers\nContact Wikipedia\nCode of Conduct\nDevelopers\nStatistics\nCookie statement\nMobile view\nSearch\nSearch\nToggle the table of contents\nMusic theory\n54 languages\nAdd topic"
  },
  {
    "source": "https://tonedear.com/",
    "content": "Ear Training\nToggle navigation\nToned Ear: Ear Training\nHome\nExercises\nIntervals\nChords\nScales\nChord Progressions\nPerfect Pitch\nScale Degrees\nIntervals in Context\nMelodic Dictation\nHow to practice\nFor teachers\nAndroid & iOS App\nContact Me\nEar Training Practice\nThese exercises will improve your musical ability by developing a more intuitive understanding of what you hear.\nFor best results, practice a little bit every day\n:\nIntervals\n:\nIn this exercise, you will hear two notes in sequence. Your goal is to identify the interval between the two notes.\nChords\n:\nIn this exercise, you will hear a chord. Your goal is to identify the type of chord that you heard.\nScales\n:\nIn this exercise, you will hear a scale. Your goal is to identify the name of the scale that you heard.\nChord Progressions\n:\nIn this exercise, you will hear a chord progression. Your goal is to identify each chord that you heard.\nPerfect Pitch\n:\nIn this exercise, you will hear a single note. Your goal is to identify the name of the note.\nScale Degrees (functional)\n:\nIn this exercise, you will hear a short chord progression followed by a single note. You must identify the scale degree of that note relative to the key established by the chord progression. This is also known as \"functional ear training\".\nIntervals in Context (functional)\n:\nThis exercise combines the \"Intervals\" and \"Scale Degrees\" exercises. In this exercise, you will hear a short chord progression followed by two notes. You must identify the major scale degrees of the two notes relative to the key established by the chord progression as well as the interval between the two notes.\nMelodic Dictation\n:\nIn this exercise, you will hear a short chord progression followed by a short melody. You must identify the major scale degree of each note in the melody.\nFor Teachers\nIf you are a teacher who would like to use these exercises in the classroom,\ncheck out the teacher version of the site\n:\nGive assignments online with specific exercise settings\nView student scores\nMore exercises -- music theory exercises like chord building and key signature identification\nClick here\nto use the teacher site."
  }
]